[
{"title": "In Response to ENR Field Hearing at Robbins Lumber, King Introduces Combined Heat and Power Support Act", "date": ["Thursday, November 16, 2017"], "release": "In response to input from leaders of the forest products industry at the October U.S. Senate Energy and Natural Resources Committee field hearing at Robbins Lumber in Searsmont, U.S. Senator Angus King (I-Maine) today introduced the Combined Heat and Power (CHP) Support Act, legislation that would help sustain and strengthen rural industries and create jobs by reauthorizing the CHP technical assistance partnership (TAP), which sunset in September of this year. The bill would also provide funding for the CHP TAP program for the next five years. CHP technology can efficiently leverage byproducts of the forest industry and turn them into added value for local economies, which would diversify energy options for rural industries, increase markets for forest products residuals, and maximize use of Maine’s natural resources.             “In Maine and throughout the country, lowering energy costs is essential to supporting rural industry and fostering job creation,”  . “At Robbins Lumber in October, the Energy and Natural Resources Committee, industry stakeholders, and representatives from the Department of Energy were able to see firsthand how innovative approaches to controlling energy costs can be good for business, and good for the health and vibrancy of the surrounding community. Maine sits on a goldmine of fiber, and by offering an array of strategies to Maine businesses, we can better manage energy usage and ensure our forest products sector is leveraging every inch of the tree – from stump to stem.”             “As we look to diversify and restore markets for full utilization of our forest resources, wood energy is an extremely important opportunity for Maine’s loggers and truckers,”  . “The DOE Technical Assistance program can provide important tools to assist Maine in expanding market opportunities for wood energy to make Maine more energy independent.”             \"Enabling biomass power facilities to sell the heat produced in generating electricity is the next frontier for our industry  \"We thank Senator King for fighting for this funding, which will go toward helping biomass facilities do the necessary upgrades to sell heat. This could boost not only biomass facilities, which face stiff competition in current power markets, but also the larger forest products industry in Maine and around the country.\"              “The Alliance for Industrial Efficiency applauds Senator King for his leadership in introducing legislation to authorize the Department of Energy’s Combined Heat and Power Technical Partnership Program (“CHP TAPs”),”   “The CHP TAPs and the supporting efforts of the DOE Advanced Manufacturing Office’s Technical Assistance Partnerships save consumers money, increase economic competitiveness, strengthen our nation’s energy security, and reduce harmful emissions through the use of CHP. By authorizing the continuation of the CHP TAPs, Senator King will help manufacturers, universities, and institutions save money, reduce their energy use, increase their reliability in the face of extreme weather events that may compromise the grid, and lower their emissions.” Specifically, the CHP Support Act would authorize $12 million in funding for the CHP TAP program each year through Fiscal Year 2022. The CHP TAP program enables higher education research centers to provide assistance and analysis for any business looking to invest in CHP technology and has supported a wide-range of businesses throughout the country. In Maine, the program has helped multiple businesses install energy-efficient CHP equipment that has saved energy costs. Following Hurricane Maria, some of the only facilities with power in Puerto Rico were hospitals with on-site CHP technology. In early October, Senator King hosted a Senate Energy and Natural Resources Committee field hearing at Robbins Lumber, a fifth-generation family owned sawmill in Searsmont, to discuss how CHP and microgrid technology approaches can support rural industries and communities and to underscore the energy saving potential of colocation energy approaches. Robbins Lumber currently has a CHP facility under construction that will generate electricity and thermal energy from wood waste produced in the region’s logging operations and sawmills. The field hearing included witnesses from the Maine forest products and energy industries as well as the Director of the Advanced Manufacturing Office in the Department of Energy. Senator King has been a strong advocate for reducing energy costs and supporting job growth for Maine industry. The Economic Development Assessment Team (EDAT),  , recommended the development of markets for forest product residuals including low-value wood in CHP biomass plants, micro-grids, and modern thermal systems. In the EDAT report, the Department of Energy announced support through its CHP Technical Assistance Program to help Maine’s forest industry with feasibility assessments of existing operations to install CHP technology as a strategy to lower costs through generating onsite power. Senator King has also introduced the  , bipartisan legislation that would establish a tax credit for business and home use of high-efficiency biomass heating equipment. Tax incentives already exist for other forms of renewable energy and this bill seeks to achieve parity between those renewable systems and thermal biomass systems.  ###"},
{"title": "Senate Passes Reconciled FY 2018 NDAA with Victories for Maine", "date": ["Thursday, November 16, 2017"], "release": "U.S. Senator Angus King (I-Maine), a member of the Senate Armed Services Committee, today announced that the U.S. Senate approved the conference committee’s bicameral agreement on the National Defense Authorization Act (NDAA) for Fiscal Year 2018, which included key victories for Maine. Senator King served on the conference committee that reconciled the differences between the Senate’s version, which passed by a vote of 89-8, and the version advanced by the House of Representatives. The bill will now go to the President for his signature.             “Throughout this process, I have proudly highlighted the important role that the people of Maine play in our national defense,”  . “This final bill will make sure Maine’s military personnel and workers in defense-related industries have the resources they need to continue making important contributions to national security. Now that the final bill has been passed, I hope that Congress can continue to work toward the best interest of both national safety and the economy by finally acting to end sequestration.” Senator King secured several major victories that will directly benefit Maine, including: Senator King also cosponsored an amendment authored by Senator Roger Wicker (R-Miss.) in support of the Navy’s Force Structure Assessment requirement for 355 battle force fleet ship. This requirement was codified into the final conference report. The Fiscal Year 2018 NDAA establishes policies and authorizes funding for the Department of Defense as well as the national security programs of the Department of Energy. It provides for the pay and benefits earned by members of the military and their families, provides for national defense including authorization of funds for military operations in places like Iraq, Syria and Afghanistan, and represents a vision of America’s national security goals, resources, and policies. Now that the final report has been passed by both the House and the Senate, the bill will go to the President for his signature. ###"},
{"title": "On Senate Floor, King Pushes for Funding of Federally Qualified Healthcare Centers", "date": ["Thursday, November 16, 2017"], "release": " – Today, U.S. Senator Angus King (I-Maine) spoke on the Senate floor about the importance of funding Federally Qualified Health Centers (FQHCs), which provide vital health care services to rural communities. Seventy percent of federal funding for FQHCs expired on October 1 , threatening access to health care for tens of thousands of people in Maine. “In Maine, we have 20 centers, and 70 facilities scattered all over our state and they are providing services every day to over 200,000 people,”  . “They’ve saved Medicaid over $100 million in Maine. $257 million is the estimate for what they’ve saved the overall health care system [in Maine]… One in six people in Maine get their health care from FQHC’s. 210,000 people. They accept everybody that comes in the door, I’ve been to them all over the state…These are the rural health care providers for rural America. And it’s not only Maine, it’s across the country. 10,000 sites across the United States, 26 million patients at risk…  “If we leave at the end of the year and haven’t done this, it will be a tragedy for rural America, it will be a betrayal of rural America, it will be betrayal of our constituents. All of us have been to these centers and seen the care that they provide – the caring that they provide – the passion that people bring to the services in their communities and how much they mean to their communities. This is one of the best federal programs ever created. And it’s always been supported on a bipartisan basis.” During his remarks, Senator King highlighted a recent letter from the leader of one of Maine’s 20 FQHCs. The letter lays out the challenges FQHCs are already facing based on the uncertainty of funding: a dentist recruit, who had been trained by the center in question, had his application placed on hold, calling his future employment in the region into question. This dentist’s presence is vital, as 3,000 community members are currently being served by a dentist who is planning to retire; based on uncertainty alone, thousands of people in Maine could be left without a viable option for dental care.  Senator King’s speech, which came on National Rural Health Day, is the latest example of his strong advocacy for increased support of rural health services. Last week, he   aimed at improving financial stability for rural hospitals and supporting seniors in rural Maine. He has also met with hospital administrators and health professionals in Bridgton, Lincoln, Skowhegan, Eastport and Machias to discuss the impact changes to the Affordable Care Act would have on rural Maine clinics, hospitals, patients, and local economies. Proposed cuts to health programs like Medicaid would significantly threaten the financial stability of rural hospitals which serve as one of the top employers in fifteen out of Maine’s sixteen counties. Senator King has opposed several attempts to repeal the Affordable Care Act and has repeatedly called on his colleagues to engage in bipartisan discussions to make meaningful improvements to the law rather than rushing to repeal it. This summer, Senator King   to stabilize the health care marketplace and lower the underlying costs of treatment and health coverage for people in Maine and across the country. He is a cosponsor of the bipartisan bill introduced by Senators Lamar Alexander (R-Tenn.) and Patty Murray (D-Wash.) to stabilize the individual health insurance marketplace."},
{"title": "Collins, King Announce $388,000 from USDA for University of Maine’s Potato Breeding Research", "date": ["Monday, November 20, 2017"], "release": "U.S. Senators Susan Collins and Angus King today announced that the U.S. Department of Agriculture’s (USDA) National Institute of Food and Agriculture (NIFA) has awarded a grant totaling $388,000 to the University of Maine at Orono to study potato breeding and improve quality and pest resistance in the eastern United States.               “Maine potatoes are a staple in homes around the country and are a testament to the quality of our farmers and small businesses,”  . “This funding from the USDA will support the University of Maine’s cutting-edge research into potato breeding and help the state build on our strong agricultural traditions so we can make Maine potato products more economically resilient. We’re glad the Department of Agriculture recognizes the University of Maine’s innovative research and our state’s important role in the country’s agriculture.” The grant, awarded through NIFA’s Potato Breeding Research Program, aims to increase the productivity, profitability, and natural resource stewardship of potato cultivation. The University of Maine will serve as the lead on an eastern United States potato breeding project focused on developing attractive, productive, disease- and insect-resistant potato varieties for both large and small scale production. This will positively impact productivity and quality of eastern U.S. potatoes, while also decreasing the economic impact of pests.  Senators Collins and King have been longtime advocates for Maine’s agricultural heritage. In September, they introduced the bipartisan  , which would double the funding for two USDA export promotion programs and help U.S. farmers stay competitive in the global markets. Senator King recently attended the Harvest Festival in Bangor and met with members of the Maine Potato Board to highlight the CREAATE Act and the impact it would have on Maine’s local farmers. The USDA NIFA invests in agricultural research and education through projects like the one at the University of Maine to directly support the prosperity of U.S. agriculture. "},
{"title": "In Belfast, King Meets with Belfast Community Members, Hears from Local Business Leaders", "date": ["Tuesday, November 21, 2017"], "release": "– U.S. Senator Angus King (I-Maine) today visited the Belfast region to hear from business leaders and community members about important issues impacting the area. Senator King began the day visiting Bank of America, met with community and business leaders at the Belfast Co-op, and visited Front Street Shipyard. He will end the day meeting with Sprague Energy at Mack Point Terminal in Searsport.             “One of the most important parts of my job is to listen. And whether it’s in hearings in Washington, or right here on Front Street in Belfast, listening helps guide my work on behalf of our state,”  . “These meetings in Belfast today provided important insight into the many different ways we can work together to grow the economy and support Maine people. From food to ferries, innovation starts with local people driven to help their communities, and it was great to see people in Belfast working to support their neighbors and build a diverse, resilient economy.” In the morning, Senator King toured the Bank of America in Belfast, which employs about 725 Maine people and is a significant economic driver for the region. Following the tour, Senator King met with local leaders for lunch at the Belfast Co-op. The Belfast Co-op, founded in 1976, is one of the oldest co-ops in Maine and one of the largest in New England. With over 3,900 members, the Co-op has continued to expand and improve to support the local economy and Belfast’s vibrant natural foods industry. In the afternoon, Senator King visited Front Street Shipyard to discuss its proposed new manufacturing line, which is intended to support the construction of carbon fiber ferries. The proposal would expand Front Street’s operation to new markets and help grow the region’s workforce. The shipyard is partnering with the Norwegian-based company Brodene Aa, which designs and constructs fast, fuel-efficient ferries, to establish a foothold for carbon fiber ferries in U.S. markets. Ferries currently carry about 103 million passengers and more than 37 million vehicles per year in the United States. Senator King will end the day meeting with Sprague Energy at Mack Point Terminal in Searsport to discuss infrastructure plans to support the export of forest products and the construction of a new crane for a liquid dry dock to support offshore wind project efforts. "},
{"title": "In November Podcast, King Highlights Service and Activism of Maine Veterans", "date": ["Saturday, November 25, 2017"], "release": "U.S. Senator Angus King (I-ME) today released the November edition of his Inside Maine podcast. In this edition, Senator King speaks with Carmine Pecorelli, a veteran of World War II, the Korean War, and the Vietnam War, about time in the military and how he’s continued his lifetime of service as a volunteer advocate for veterans. Senator King then speaks to Deo Lauria, a retired Army Lieutenant Colonel and the outgoing District Service Officer for the American Legion at Togus. Senator King and his guests discuss the importance of serving Maine veterans. “Maine has a long and storied history of military service that continues to this day, as our state has one of the highest percentages of veterans in the country,” said Senator King. “These are men and women who deserve our deepest gratitude for their military service – but it’s important to recognize that their efforts continued after they took off the uniform. Carmine and Deo are phenomenal examples of that continued work; pillars of service above self, these men exemplify how vibrant and vital Maine’s veterans community is. It was my pleasure to speak with them and highlight the good work they do for Maine’s veterans. ”   Since arriving in Washington, Senator King has been a strong advocate for veterans issues. This was particularly true in November: over Veterans Day weekend, he joined members of the community to  , where he provided keynote remarks and participated in the wreath laying cemetery. He also spoke at the opening of the Maine Troop Greeters Museum at Bangor International Airport, and presented World War II Veteran and Penobscot Tribal Elder with a flag flown over the U.S. Capitol. Earlier in the month, Sen. King also announced his support for  . These are just the latest examples of Senator King’s continued efforts for Maine’s veteran population. Through his work on the Senate Armed Services Committee, Senator King has supported multiple amendments to the National Defense Authorization Act (NDAA) that support American veterans. In the Fiscal Year 2018 NDAA, Senator King cosponsored an amendment authored by Senator Thom Tillis (R-N.C.) that would encourage cooperation and integration between the Departments of Veterans Affairs and Defense with their electronic health care record systems to improve the transition from active duty to veteran status and ensure that veterans won’t have to wait to gain access to the health care services they have earned. He also supported an amendment authored by Senator Tim Kaine (D-Va.) that would encourage the Secretaries of Veterans Affairs and Defense to assess the feasibility of establishing a joint office to house an interagency task force on suicide prevention. Senator King supports the coordination between the departments so that those who have served do not slip through the cracks. He is a strong supporter of the  , which helps veterans across Maine and the nation receive health care within their communities and allows veterans in Northern Maine to seamlessly utilize community care as they formerly did under the Access Received Closer to Home (ARCH) pilot. In August, the President signed into law  , legislation he cosponsored that would overhaul the Department of Veteran Affairs’ (VA) appeals process. The “Inside Maine Podcast with Senator Angus King” is a 30-minute program that aims to help keep Maine people informed about issues of the day, how they affect life in the state, and how they factor into Senator King’s work as one of two independents in the U.S. Senate. Senator King’s podcast builds on his existing radio show that airs on Newsradio WGAN in Portland, Maine between 10 and 11 a.m. on almost every last Saturday of the month. A link to the November podcast can be found  ."},
{"title": "On Small Business Saturday, King Highlights Local Economy in Oxford County", "date": ["Saturday, November 25, 2017"], "release": "– U.S. Senator Angus King (I-Maine) today met with small business owners and community members in the Norway/South Paris region to underscore how supporting local businesses can grow the Maine economy. His visit came on Small Business Saturday, which falls on the Saturday after Thanksgiving and emphasizes the importance of supporting local small businesses, particularly during the holiday season. “Small businesses are the backbone of our economy. All across Maine, there are independently-owned businesses that create jobs for local people and foster growth and innovation in our communities,”  . “The local business owners I met with in Paris and Norway today characterize Maine’s entrepreneurial spirit, and -- by working to grow the economy -- demonstrate a dedication to friends and neighbors to make their communities more resilient. During this holiday season, let us reaffirm our commitment to buying local so we can support the Main Streets of our hometowns and help keep Maine a special place to work and live.” In the morning, Senator King visited Café Nomad in Norway to meet with local people. Following this, Senator King stopped at a variety of small businesses on Main Street in Downtown Norway and had lunch at the family-owned Norway Brewing Company. He also attended the Oxford Hills Chamber of Commerce’s Christmas Parade, which is the state’s largest Christmas Parade. Earlier this month, Senator King cosponsored a bipartisan U.S. Senate resolution to recognize the importance of Small Business Saturday for local businesses across the country."},
{"title": "In Budget Committee, King Urges Caution on Rushed Tax Reform Process", "date": ["Tuesday, November 28, 2017"], "release": "U.S. Senator Angus King (I-Maine), a member of the U.S. Senate Budget Committee, today urged caution on rushing the proposed tax reform plan through the Senate without substantial hearings, feedback from the public, or information from experts. His remarks come days ahead of a planned vote before the full Senate on the tax cut framework.             “We could get 70 votes, or 80 votes, for a tax reform proposal that was less damaging to the deficit, more stimulative to the economy, and more fairly distributed,”  . “[…]Let’s slow down, have a real process, get input from people all across the country, find out what this bill would actually do. Change it. Improve it. And then come out with a product that can be passed on a bipartisan basis, will be much more consistent with the needs and desires of the American people, and will make – I believe – a difference for the next generation. Instead of being a millstone, it will be an opportunity.” This morning, Senator King joined a group of moderate Democrats to underscore the potential and desire for bipartisan compromise on tax reform. The press conference is available in full  . Senator King has consistently called for a responsible, balanced, and long-term approach to addressing the United States national debt and deficit, and was named a “Fiscal Hero” in 2016 by Campaign to Fix the Debt. The Budget Committee approved the Fiscal Year 2018 budget resolution by a 12 to 11 party-line vote in October.  ###"},
{"title": "King, Bipartisan Group of Colleagues Reintroduce Bill to Prioritize Preventive Healthcare  ", "date": ["Wednesday, November 29, 2017"], "release": " – U.S. Senators Angus King (I-Maine), Mike Crapo (R-Idaho) and Ben Cardin (D-Maryland), along with Tom Udall (D-New Mexico) today reintroduced    legislation that would direct the Congressional Budget Office (CBO) to more accurately reflect the cost-savings of preventive healthcare, including health screenings. “Congress has recently spent a lot of time debating the best methods of paying for healthcare, and for good reason: the American people rely on this care to live happy, healthy lives,”  But these recent discussions don’t address the underlying problem of overall healthcare spending. Regardless of who is writing the check, the current trajectory of healthcare spending is unsustainable. We need to make the most of options like preventive care, which is proven to control costs and improve the overall health of communities. By ensuring that future Congressional Budget Office studies extend beyond the existing ten-year budget window, this bill will help us fully understand the long-term benefits and maximize the impact of preventive care to improve overall health, in Maine and across the country.” “This bipartisan legislation is a simple fix that will allow the Congressional Budget Office to capture the long-term savings that can be achieved through preventive health care, arming lawmakers with more accurate information when considering legislation to improve health care system,”  . “Prevention and early detection through cancer screenings, counseling, and immunization all lower healthcare costs by reducing the severity of disease. As a nation, we spend far more on the treatment of disease than we do on preventive health. But our neglect of prevention has been costly, overwhelming our healthcare budgets, particularly Medicare and Medicaid,”   “Re-evaluating our budget rules is not a new phenomenon. As our nation shifts its focus to more preventive healthcare, our budgets and accounting methods should shift too.” “Preventive health care has been proven time and time again to save lives and dramatically lower costs, and that is an investment that is well worth making,”  . “This bill will ensure that lawmakers have that information at their fingertips to help make better decisions about these programs in the future.” “The Preventive Health Savings Act recognizes the importance of preventing chronic diseases and promoting behavioral health,”   “We know that lifestyle support programs such as the National Diabetes Prevention Program lead to significant cost-savings that extend beyond the Congressional Budget Office’s traditional scoring window of 10 years. Evaluating cost-savings further into the future, as would be allowed by the Preventive Health Savings Act, will provide a more comprehensive appraisal of critical programs that promote wellness and disease prevention, while reducing health care costs and overall spending, and thus improving the lives of millions of Americans.” The American Diabetes Association is one of 120 organizations that have expressed support for the Preventative Health Savings Act. November is National Diabetes Awareness Month, and the disease is one of the leading chronic diseases causing death and disability in the United States. According to the U.S. Centers for Disease Control and Prevention (CDC), efforts to treat chronic diseases account for over 80 percent of America’s health care costs.  Preventive care – such as health screenings, shots, and lab tests – can help prevent chronic disease and ultimately lead to savings in health care costs. Under current law, however, the CBO does not take into account the long-term cost-savings associated with preventive health initiatives.  would direct the CBO to more accurately reflect the cost-savings of preventive health care legislation by allowing Congressional Committees – including the Budget; Health, Education, Labor and Pensions; Finance; Ways and Means; and Energy and Commerce Committees – to request an analysis of preventive measures extending beyond the existing 10-year budget window to two additional 10-year periods. By allowing the CBO to widen its budget window to better capture the costs-savings from preventive care, the legislation encourages a sensible review of health policy in order to promote public health and incentivizes Congress to invest in proven methods of saving lives and money.‎ Senators King, Crapo and Cardin originally introduced the bill in 2013, and reintroduced the bill in 2016. ###"},
{"title": "Collins, King Applaud University of Maine Designation as a Combined Heat and Power Assistance Center", "date": ["Wednesday, November 29, 2017"], "release": "U.S. Senators Susan Collins and Angus King today applauded the U.S Department of Energy (DOE) decision to select the University of Maine as a regional Combined Heat and Power (CHP) Technical Assistance Partnership (TAP) program designee. The announcement includes $25 million in DOE funding, which will be disbursed over five years to eight new CHP TAP designees, including the University of Maine. The funding aims to advance the installation of cost-effective, highly efficient CHP technologies. CHP technologies can efficiently leverage forest industry byproducts and turn them into added value for local economies, which diversifies energy options for rural industries, increases markets for forest products residuals, and maximizes use of Maine’s natural resources.             “CHP technologies provide an exciting opportunity to explore innovative strategies that lower energy costs and strengthen the Maine economy,”  “By leveraging our state’s natural resources, we can bolster the forest products industry and help create jobs that support our rural communities. We are thrilled the Department of Energy has recognized the University of Maine as a premier research institution that can help industries in Maine further develop the potential of CHP technology.”            \"We are thrilled to be part of this important Department of Energy Program,”  Maine. “Combined Heat and Power (CHP) systems offer real solutions to today's energy issues: supporting economic development through improved energy efficiency, increased energy resiliency, and lower energy costs. We have a strong team of experts at the University of Maine and the University of New Hampshire, and look forward to working together to promote cost-effective energy systems in Maine, New Hampshire, and New England.\" With the DOE investment, the University of Maine will become a regional CHP Technical Assistance Partnership (CHP TAP), which enables higher education research centers to provide assistance and analysis for any business looking to invest in CHP technology.  This DOE program has supported a wide-range of businesses throughout the country. In Maine, the program has helped multiple businesses install energy-efficient CHP equipment that has saved energy costs. Following Hurricane Maria, some of the only facilities with power in Puerto Rico were hospitals with on-site CHP technology. In early October, Senator King hosted a Senate Energy and Natural Resources (ENR) Committee field hearing at Robbins Lumber, a fifth-generation family owned sawmill in Searsmont, to discuss how CHP and microgrid technology approaches can support rural industries and communities and to underscore the energy saving potential of colocation energy approaches. Robbins Lumber currently has a CHP facility under construction that will generate electricity and thermal energy from wood waste produced in the region’s logging operations and sawmills. The field hearing included witnesses from the Maine forest products and energy industries as well as the Director of the Advanced Manufacturing Office in the Department of Energy. In response to input from leaders of the forest products industry at the October ENR field, Senator King introduced the  , legislation that would help sustain and strengthen rural industries and create jobs by reauthorizing the CHP technical assistance partnership (TAP). Specifically, the CHP Support Act would authorize $12 million in funding for the CHP TAP program each year through Fiscal Year 2022.  The Economic Development Assessment Team (EDAT),  , recommended the development of markets for forest product residuals including low-value wood in CHP biomass plants, micro-grids, and modern thermal systems. In the EDAT report, the Department of Energy announced support through its CHP Technical Assistance Program to help Maine’s forest industry with feasibility assessments of existing operations to install CHP technology as a strategy to lower costs through generating onsite power.       The DOE’s CHP activities, led by the Office of Advanced Manufacturing, focus on early-stage research and development, as well as public-private partnerships and field validation of CHP technologies. ###"},
{"title": "In Armed Services Hearing, King Underscores Importance of Diplomacy for National Security", "date": ["Thursday, November 30, 2017"], "release": " U.S. Senator Angus King (I-Maine) today underscored the importance of diplomatic efforts to support and strengthen United States national security interests during a hearing before the Senate Armed Services Committee. The hearing was held to receive testimony from outside experts on recommendations for a future National Defense Strategy. “Defending the national security of the United States involves a continuum, it seems to me, that goes from diplomacy to war,”  . “War is the most expensive and least desirable of those outcomes.             “I think of Afghanistan. Our success there will ultimately depend upon the success of the government in Afghanistan to gain the confidence of its people. In Iraq, the relationship between the government of Iraq, and the Kurds, and the Sunni population is ultimately going to determine if Iraq is a successful state. North Korea, the solution to North Korea lies through diplomacy with China. I think everyone appreciates and understands that. The reason Iran is not North Korea today is because of the JCPOA, which was passed two years ago. Otherwise – according to the intelligence services – we would be dealing with an Iran with a nuclear weapon, today, about two years from when we passed that bill. Israel-Palestine, a major flashpoint for conflict in the Middle East, it’s all about diplomacy.” Senator King went on to discuss the issues with staffing at the U.S. Department of State, and highlighted the need to fill important posts at the department.             “Right now, by the way, under the current dispensation, this part of the strategy – that is diplomacy – is being drastically downgraded, with budgets cut at the State Department,”  . “We don’t have an Ambassador to South Korea, for example, or even a nominee.” The witnesses before this morning’s hearing were Dr. Mara E. Karlin, Associate Professor Of The Practice Of Strategic Studies, Johns Hopkins School Of Advanced International Studies; Dr. Thomas G. Mahnken, President And Chief Executive Officer, Center For Strategic Budgetary Assessments; Mr. David A. Ochmanek, Senior Defense Research Analyst, RAND Corporation; Lieutenant General Thomas W. Spoehr, USA (Ret.), Director Of The Center For National Defense, Heritage Foundation; Ms. Mackenzie Eaglen, Resident Fellow Of The Marilyn Ware Center For Security Studies, The American Enterprise Institute. ###"},
{"title": "Ahead of Vote on Tax Reform, King Warns of Proposal’s Dangerous Impact on National Debt", "date": ["Thursday, November 30, 2017"], "release": " Today, U.S. Senator Angus King (I-Maine) spoke on the Senate floor about the dangerous impact the Senate tax reform proposal would have on the national debt. Senator King’s comments came during debate on an amendment he offered to refer the bill to committee with instructions to create a deficit-neutral proposal, which the Senate voted on tonight. His amendment was defeated by a vote of 48 to 52. “One of my concerns…that I want to focus on today, and the background of my amendment which recommits and asks that the Committee come back with a deficit-neutral bill, is the debt and the deficit,”  . “If you notice there’s a pattern here…the pattern is that when we get into major catastrophes – including war – that’s when we have to borrow money…this is why you preserve your borrowing power for when you actually need it… “Look where we’re headed – we’re headed to a place where we aren’t going to be able to sustain this debt. Everybody knows that, and yet the bill that we’re voting on today expands the deficit by somewhere between half a trillion and two and a half trillion dollars, depending upon how it’s all sorted out…it’s shameful, and it’s going to come back to haunt us… “Now I’ve been around public life and politics for a long time, and I’ve heard a lot about deficits, and people are concerned about deficits – until today! The deficit doesn’t seem to be a big deal anymore. I predict that after this bill passes, within a couple of years when the deficits start to mount up, the same people who are voting for this bill today are going to say, ‘Oh my goodness, we have these huge deficits, what are we going to do? I think we have to cut entitlements, we have to cut Social Security, we have to cut Medicare and certainly we have to cut all those domestic programs.’ Well [Mr. President], I don’t think that’s right… “What we’re doing is simply borrowing money from our children to give ourselves tax cuts. That’s really the essence of what’s going on here. If we were cutting taxes on a revenue-neutral basis, that would make sense…but instead, all we’re doing is shifting the tax to our kids…If 5 year-olds knew what we were doing and could vote, none of us would have a job – because we are spending their money. It’s as if you’re lying on your deathbed, you call your children over to hear your last words, and your last words are ‘Here’s the credit card, we had a great vacation, your mother and I. You pay the bill.’ That’s what we’re doing, and it’s wrong. It’s unethical – we are passing the bill onto our children… “…the idea that these tax cuts are going to pay for themselves? It’s never happened. It’s never happened, it didn’t happen to the Bush tax cuts, it hasn’t happened in Kansas, it just hasn’t happened. So we’re talking about a dramatic increase in the federal deficit on top of what’s already coming… these are the times when we should be paying back this debt, not making it worse. No rational business would be taking on debt when they’re doing well – when you’re doing well, you pay down your debt, and then you have a reserve for when you need it. We have no reserve – we’re using up our cushion. We’re using up whatever cushion we might need for disasters, for some kind of – heaven forbid – conflict, or simply for a recession. This is an incredibly destructive bill, and it doesn’t have to be that way… “There are many other issues with the bill, but I chose today to focus in my remarks and also on my amendment, on the effects on the deficit because I think it’s one of the most long-term threats. In fact, a former head of the Joint Chiefs of Staff said the national debt is the most serious threat to our national security in the long run. And to aggravate it unnecessarily as this bill would do, I think is irresponsible. Mr. President, we can do better – I am sure of that – if we’ll slow down, listen to one another, and do what the American people expect of us.” Senator King, a member of the Senate Budget Committee, has consistently called for a responsible, balanced and long-term approach to addressing our national debt and deficit.   by the Campaign to Fix the Debt, a nonpartisan movement to put America on a better fiscal and economic path. "},
{"title": "King Statement on Senate Passage of Tax Bill", "date": ["Saturday, December 2, 2017"], "release": " – U.S. Senator Angus King (I-Maine), a member of the Senate Budget Committee, released the following statement after the Senate passed its tax bill: “Tonight, I’m disappointed, and I’m angry, because the American people deserve better. For months, moderates in the Senate reached across the aisle to colleagues – and friends – asking them to sit down and work together on a commonsense tax reform bill that supports hardworking Americans and fosters economic growth for businesses in Maine and across the country. In other words: to govern. But instead of digging in and doing the hard work, this Senate has decided to pass a bill that helps the few instead of the many, and shifts a massive financial burden onto our children. Rather than maximize this opportunity to help working Americans and set our nation on a path to further prosperity, this bill pushes through at least $1 trillion in unfunded tax cuts for the wealthy and for corporations. These cuts are not only misguided – they’re downright dangerous, and their effects will be felt by every aspect of our society, from the health of our economy to our national security interests. “By rushing this legislation through the Senate with no hearings, no input from experts and no feedback from the American people, we’ve advanced a terrible bill that will have terrible consequences. If history is any guide, this will be the major tax reform bill of the next 20 to 30 years, affecting every business, every citizen, and our entire economy. I’m disappointed today – but I hope members of Congress will reconsider the chance to work across the aisle to make fixes to this deeply flawed piece of legislation, so we can mitigate the damage to everyday Americans.” Senator King has consistently called for a responsible, balanced and long-term approach to addressing our national debt and deficit. On Thursday, he offered an amendment to refer the tax bill to the Finance Committee with instructions to create a deficit-neutral proposal. The amendment failed along party lines following more than an hour of debate and an unusually long voting period.   by the Campaign to Fix the Debt, a nonpartisan movement to put America on a better fiscal and economic path. "},
{"title": "King Announces Victories for Maine in Reconciled FY 2018 NDAA", "date": ["Thursday, November 9, 2017"], "release": "U.S. Senator Angus King (I-Maine), a member of the Senate Armed Services Committee, today announced that the House-Senate conference committee’s bicameral agreement on the National Defense Authorization Act (NDAA) for Fiscal Year 2018 included key victories for Maine. Senator King served on the conference committee that reconciled the differences between the Senate’s version, which passed by a vote of 89-8, and version advanced by the House of Representatives. The conference report now must be voted on and passed in both chambers of Congress. “The people of Maine have long played a vital role in our national defense, and this bill will allow them to continue that tradition,” said Senator King. “I am proud that this bipartisan agreement gives Maine’s military personnel and workers in defense-related industries the resources they need to continue making important contributions to protecting our nation. I hope that Congress can build on this positive step by working together to end sequestration, an action that would provide additional resources and boost both our national security interests and our economy.” Senator King secured several major victories that will directly benefit Maine, including: Senator King also cosponsored an amendment authored by Senator Roger Wicker (R-Miss.) in support of the Navy’s Force Structure Assessment requirement for 355 battle force fleet ship. This requirement was codified into the final conference report. The Fiscal Year 2018 NDAA establishes policies and authorizes funding for the Department of Defense as well as the national security programs of the Department of Energy. It provides for the pay and benefits earned by members of the military and their families, provides for national defense including authorization of funds for military operations in places like Iraq, Syria and Afghanistan, and represents a vision of America’s national security goals, resources, and policies. Now that the bipartisan report has been agreed to by the conference committee, the House and the Senate will each vote on the final report and, if it passes, send the final version to the President for his signature. "},
{"title": "King Backs Bills to Protect Veterans’ Credit Ratings, Educational Opportunities", "date": ["Thursday, November 9, 2017"], "release": " U.S. Senator Angus King (I-Maine) today announced support for two pieces of legislation that would protect veterans credit ratings and educational opportunities respectively. The    , bipartisan legislation introduced by Senator Joe Donnelly (D-Ind.) and Mike Rounds (R-S.D.), would protect the credit ratings of veterans wrongly penalized by medical bill payment delays by the Department of Veterans Affairs (VA). The   prevents targeting of veterans by low-quality, for-profit universities by closing the loophole that allows for-profit schools to avoid securing at least 10 percent of their revenue from non-federal sources. The current loophole excludes the Department of Veterans Affairs (VA) and Department of Defense (DOD) education funds, like the Post-9/11 GI Bill and Tuition Assistance (TA), from being counted as federal funds.             “Our nation’s veterans have defended our country with honor and distinction, and deserve every opportunity to get a quality education, buy a house, or take out a loan,”  . “No veteran should be penalized because of bureaucratic delays at the VA, or be targeted by the predatory practices of some for-profit schools. It’s our duty to protect them when they return home as they have protected us. These commonsense bills will support the men and women who answered the call to serve in the defense of our freedom.” The   would prohibit medical debt from services received through the Choice Program and other VA community care programs from being reported to credit reporting agencies for one year. This delay provides adequate time for the VA and its contractors to resolve any issues related to inappropriate assignment of debt. The bill would also allow veterans to dispute and remove adverse actions already on their reports. Impacted veterans could submit a notice along with proof that the VA is liable for the debt to a consumer reporting agency (CRA). The CRA would then have to delete all information relating to the veterans’ medical debt from their file and notify the furnishers and the veterans that they have done so. More than two decades ago, Republican President George H.W. Bush signed a bipartisan law that limited how much federal funding for-profit schools may receive from taxpayers. Now called the 90/10 rule, this limit requires for-profit schools to obtain at least 10 percent of their revenues from non-federal sources. Some for-profit schools exploit this 90/10 loophole by using aggressive recruitment practices and deceptive marketing tools to enroll servicemembers, veterans and other GI Bill beneficiaries.   would close the 90/10 loophole by counting VA and DOD funds as federal dollars. Since arriving in Washington, Senator King has been a strong advocate for veterans issues. Through his work on the Senate Armed Services Committee, Senator King has supported multiple amendments to the National Defense Authorization Act (NDAA) that support American veterans. In the Fiscal Year 2018 NDAA, Senator King cosponsored an amendment authored by Senator Thom Tillis (R-N.C.) that would encourage cooperation and integration between the Departments of Veterans Affairs and Defense with their electronic health care record systems to improve the transition from active duty to veteran status and ensure that veterans won’t have to wait to gain access to the health care services they have earned. He also supported an amendment authored by Senator Tim Kaine (D-Va.) that would encourage the Secretaries of Veterans Affairs and Defense to assess the feasibility of establishing a joint office to house an interagency task force on suicide prevention. Senator King supports the coordination between the departments so that those who have served do not slip through the cracks. He is a strong supporter of the  , which helps veterans across Maine and the nation receive health care within their communities and allows veterans in Northern Maine to continue to utilize community care as they did under the Access Received Closer to Home (ARCH) pilot. In August, the President signed into law  , legislation he cosponsored that would overhaul the Department of Veteran Affairs’ (VA) appeals process. Senator King’s support for the two bills comes ahead of Veterans Day weekend, where Senator King will honor the dedication and sacrifice of Maine veterans. Tomorrow, he will participate in the Grand Opening and Ribbon Cutting of the Maine Troop Greeters Museum at Bangor International Airport, who have welcomed more than 1.5 million troops flying through Bangor International Airport on the way to or returning from deployment. Following the grand opening, Senator King will travel to Penobscot Indian Island Reservation to present Charles Norman Shay with a flag flown over the United States Capitol. Mr. Shay is a Penobscot Tribal Elder and a veteran of World War II who served as a medic during the D-Day invasion of Normandy on June 6 , 1944. Mr. Shay was awarded a Silver Star for his service, and earlier this year the ‘Charles Shay Indian Memorial’ was dedicated in Normandy, France to honor of the service of Native Americans who participated in Operation Neptune for the liberation of Normandy in World War II. After presenting Mr. Shay with the flag, Senator King will visit with community members on Indian Island."},
{"title": "In Bangor, King Announces Letter to CMS Administrator Requesting Extension of Open Enrollment for Maine Due to Power Loss Following October Storm ", "date": ["Friday, November 10, 2017"], "release": " U.S. Senator Angus King (I-Maine) today announced that he sent a letter to Centers for Medicare and Medicaid Services Administrator Seema Verma to request an extension of the 2018 Affordable Care Act open enrollment period for Maine. The request comes following a severe storm caused more than 400,000 people in Maine to lose power as the shortened open enrollment period began. “As you may know, a severe storm with hurricane-force winds recently hit Maine causing historic, widespread power outages,”  . “Without access to electricity and or communications it is nearly impossible to effectively shop for health insurance.  Clearly, for those trying to enroll in healthcare, the timing of this event is dire. Because of the storm damage many Maine residents will lose nearly 1/3 of the Open Enrollment period… I respectfully ask that you consider extending the Open Enrollment period for the State of Maine to provide those recovering from the storm additional time to shop for health insurance coverage.” Senator King announced the letter at Penobscot Community Health Care, where he continued his open enrollment information tour to provide information to Maine citizens about the Affordable Care Act (ACA) open enrollment period. Open enrollment began on November 1 and currently stands to end on December 15 . The press conference featured health care professionals and advocates, application assisters, and health care providers. In recent months, the Administration has launched numerous efforts to undermine open enrollment including reducing the length of open enrollment from 12 weeks to 6 weeks, announcing a 12-hour shutdown of the ACA website over weekends, and drastically cutting funding for advertising and insurance navigator programs. Despite these changes, the Affordable Care Act’s benefits and assistance with enrollment remain available for those who sign up within the shortened time period. Senator King has been outspoken in his desire to improve the Affordable Care Act to protect coverage for the millions who rely on it for affordable healthcare, and is a cosponsor of the bipartisan bill introduced by Senators Lamar Alexander (R-Tenn.) and Patty Murray (D-Wash.) to stabilize the individual health insurance marketplace. Today’s event marks the latest iteration of Senator King’s Open Enrollment information tour. In October,   at the Opportunity Alliance in South Portland to encourage Maine people to learn more about their health care options and get coverage, and in earlier this week   at Central Maine Medical Center in Lewiston. He also hosted a  , where he shared a personal story about how insurance saved his life more than 40 years ago. For more information Maine people can reach out to Maine Consumers for Affordable Health Care, call 1-800-965-7476, and/or visit healthcare.gov. The full text of the Senator’s letter can be found  ."},
{"title": "King Presents Flag Flown Over U.S. Capitol to Penobscot Tribal Elder and World War II Veteran ", "date": ["Friday, November 10, 2017"], "release": " – In advance of Veterans Day, U.S. Senator Angus King (I-Maine) today presented Charles Norman Shay with a flag flown over the United States Capitol. Mr. Shay is a Penobscot Tribal Elder and a veteran of World War II who served as a medic during the D-Day invasion of Normandy. Prior to presenting the flag to Mr. Shay, Senator King participated in the Grand Opening and Ribbon Cutting of the Maine Troop Greeters Museum at Bangor International Airport. The museum celebrates the Maine Troop Greeters, who have welcomed more than 1.5 million servicemembers flying through Bangor International Airport on the way to or returning from deployment. “The service of Charles Norman Shay deserves our deepest gratitude, and the devotion of the Maine Troop Greeters remind us of the best way to express our appreciation,” said Senator King. “On June 6 , 1944, a 19-year old Charles Norman Shay stormed the beaches of Normandy as part of the first wave of the D-Day Invasion. Serving as a medic, he braved the treacherous seas and enemy fire to save several of his wounded comrades. Mr. Shay’s courage, commitment and ongoing leadership remind us that we cannot only honor veterans on a single day. Each and every day, we must rededicate ourselves to supporting veterans and their families, as the Maine Troop Greeters have done for more than two decades.” Senator King presented the flag to Mr. Shay at his home on the Penobscot Indian Island Reservation. Mr. Shay was awarded a Silver Star for his service in Operation Neptune, and earlier this year the ‘Charles Shay Indian Memorial’ was dedicated in Normandy, France to honor of the service of Native Americans in World War II. After presenting the flag to Mr. Shay, Senator King met with members of the community on Indian Island. The Maine Troop Greeters are a non-profit group who greet servicemembers arriving at Bangor International Airport, where many flights carrying military personnel stop while heading to or returning from deployment. The organization consists of volunteers who offer free cell phone use, snacks and support to those heading to or returning from overseas. Senator King will continue to honor the service the men and women who have served in defense of our country tomorrow, when he will observe Veterans Day by joining Maine veterans and members of the community for a service at the Northern Maine Veterans’ Ceremony in Caribou. Senator King will provide keynote remarks and participate in the wreath laying ceremony at the cemetery. With the closest National Veterans’ Cemetery more than 450 miles away in Bourne, MA and the closest State Veterans’ Cemetery nearly 250 miles away in Augusta, the Northern Maine Veterans’ Cemetery is critical to providing continued service for the approximately 7,800 veterans and their families in Northern Maine."},
{"title": "On Veterans Day, King Honors Nation’s Heroes at Northern Maine Veterans’ Cemetery", "date": ["Saturday, November 11, 2017"], "release": "U.S. Senator Angus King (I-Maine) today joined Maine veterans and members of the community for a service at the Northern Maine Veterans’ Ceremony in Caribou to honor the men and women who have served in defense of the United States. Senator King provided keynote remarks and participated in the wreath laying ceremony at the cemetery.              \"Maine has a long and storied history of military service. During the Civil War, Maine sent a higher proportion of its citizens to combat than any other state in the Union,\"  . \"To this day, Maine continues this tradition of service, with one of the highest numbers of veterans per capita in the United States. With such a strong, first-hand understanding of the contributions of veterans to our communities in Maine, our commitment to service also extends to an unwavering dedication to meeting the needs of the veterans and their families who sacrificed to keep us safe.  The greatest expression of gratitude to the neighbors, friends and family who bravely served to protect our national security and the freedoms we enjoy is to reaffirm our commitment to those veterans who struggle with unemployment, poverty, and difficulties in accessing healthcare. Let this Veterans Day be a call to action that not only on this revered day in our Nation’s history, but each and every day, we must rededicate ourselves to caring for the veterans and their families who have sacrificed on our behalf.?\" With the closest National Veterans’ Cemetery more than 450 miles away in Bourne, MA and the closest State Veterans’ Cemetery nearly 250 miles away in Augusta, the Northern Maine Veterans’ Cemetery is critical to providing continued service for the approximately 7,800 veterans and their families in Northern Maine.  This week, Senator King announced his support for two pieces of legislation that will support and protect American veterans. The    , bipartisan legislation introduced by Senator Joe Donnelly (D-Ind.) and Mike Rounds (R-S.D.), would protect the credit ratings of veterans wrongly penalized by medical bill payment delays by the Department of Veterans Affairs (VA). The   prevents targeting of veterans by low-quality, for-profit universities by closing the loophole that allows for-profit schools to avoid securing at least 10 percent of their revenue from non-federal sources. The current loophole excludes the Department of Veterans Affairs (VA) and Department of Defense (DOD) education funds, like the Post-9/11 GI Bill and Tuition Assistance (TA), from being counted as federal funds. Since arriving in Washington, Senator King has been a strong advocate for veterans issues. Through his work on the Senate Armed Services Committee, Senator King has supported multiple amendments to the National Defense Authorization Act (NDAA) that support American veterans. In the Fiscal Year 2018 NDAA, Senator King cosponsored an amendment authored by Senator Thom Tillis (R-N.C.) that would encourage cooperation and integration between the Departments of Veterans Affairs and Defense with their electronic health care record systems to improve the transition from active duty to veteran status and ensure that veterans won’t have to wait to gain access to the health care services they have earned. He also supported an amendment authored by Senator Tim Kaine (D-Va.) that would encourage the Secretaries of Veterans Affairs and Defense to assess the feasibility of establishing a joint office to house an interagency task force on suicide prevention. Senator King supports the coordination between the departments so that those who have served do not slip through the cracks. He is a strong supporter of the  , which helps veterans across Maine and the nation receive health care within their communities and allows veterans in Northern Maine to continue to utilize community care as they did under the Access Received Closer to Home (ARCH) pilot. In August, the President signed into law  , legislation he cosponsored that would overhaul the Department of Veteran Affairs’ (VA) appeals process. Following the service, Senator King is attending the Harvest Festival at the Cross Insurance Center in Bangor to hear from Maine agriculture stakeholders, farmers, food processors and brewers. Senator King will then join members of the Maine Potato Board for a press conference on the  , bipartisan legislation he introduced in September that would increase funding to successful U.S. Department of Agriculture export promotion programs and help U.S. farmers maintain an edge in the increasingly competitive global marketplace. The bill would aid two of the USDA’s most successful programs, the Market Access Program (MAP) and Foreign Market Development Program (FMDP), by doubling their funding over five years."},
{"title": "At Maine Harvest Festival, King Highlights Bipartisan Legislation to Support Agricultural Exports  ", "date": ["Saturday, November 11, 2017"], "release": "Today, U.S. Senator Angus King (I-Maine) attended the Harvest Festival at the Cross Insurance Center in Bangor and heard from Maine agriculture stakeholders, farmers and food processers. Senator King also joined members of the Maine Potato Board to highlight the  , a bipartisan bill introduced by Senator King in September that would double funding to two successful U.S. Department of Agriculture export promotion programs and help U.S. farmers maintain an edge in the increasingly competitive global marketplace. “Each and every booth at the Maine Harvest Festival serves as a reminder that our state’s agricultural products stand above the rest,” said Senator King. “But unfortunately, obstacles such as language barriers and varying regulations make it difficult for smaller farms to expand into foreign markets – in other words, it’s a tall order to ask a family farm to employ an international trade expert who’s also fluent in Mandarin. As a result, many people in foreign countries are unaware that the words “Maine-grown” are indicative of the highest quality. That’s why MAP and FMDP are so important. These programs have a proven track record of helping American farm products reach foreign markets, opening up new opportunities and adding billions of dollars to our nation’s agricultural industry. Passing the CREAATE Act would allow us to revitalize these programs, in turn creating growth in our vital agricultural industry and more good jobs across the economy.” The  which Senator King introduced in September with Senators Joni Ernst (R-Iowa), Joe Donnelly (D-Ind.) and Susan Collins (R-Maine), aims to revitalize the USDA’s export promotion programs, which generated a net return of $28.30 for every dollar invested between 1977 and 2014. The   would aid two of the USDA’s most successful programs, the Market Access Program (MAP) and Foreign Market Development Program (FMDP), by doubling their funding over five years. MAP, which is currently funded at $200 million per year, would see its funding rise to $400 million per year, while FMDP would see its funding rise from $34.5 million per year to $69 million per year. Each of these increases would take place incrementally over 5 years. MAP was established in 1985, and allows agricultural trade associations, farmer cooperatives, non-profit trade groups, and small businesses to apply for either generic or brand-specific promotion funds to support exporting efforts. Generic commodity funds are issues with a 10-percent minimum matching fund, while brand-specific funds require a funding match of at least 50%. FMDP was first developed in 1955, and is largely used for the promotion of bulk commodities, helping agricultural trade associations establish permanent presences in important markets. It also includes a matching fund requirement.  USDA export programs like MAP and FMDP have added an annual average of $8.15 billion to the value of American agricultural exports, and added up to 239,800 full and part-time jobs, including 90,000 farm sector jobs. Despite these successes, MAP and FMDP funding has not increased since the 2002 Farm Bill, even as competitors increase their efforts; for example, the European Union’s spending for the promotion of wine exceeded the total budget of MAP and FMDP in 2017. The CREAATE Act would curb this trend by providing the agricultural community with the level of support they need."},
{"title": "Collins, King Ask DOJ to Provide Guidance on Boosting Support for Forensic Labs in Efforts to Combat Opioid Epidemic", "date": ["Monday, November 13, 2017"], "release": " –U.S. Senators Susan Collins (R-Maine) and Angus King (I-Maine) joined a bipartisan group of 30 senators in a letter to U.S. Attorney General Jeff Sessions, asking him to provide Congress with information detailing how the Department of Justice (DOJ) is supporting and prioritizing forensic science service providers across the nation as a part of a broader approach to combat the opioid epidemic. “The opioid crisis knows no boundaries; it reaches into homes in every community in every region of this country. Stopping the flow of these drugs is critical to ending the crisis, but to do so requires the ability to trace the drugs to their source.  This demands a forceful and vigorous effort by our forensic science community,”  . , “The current opioid crisis has overwhelmed the nation’s collective laboratory systems with more than a 6000% increase in the last four years, according to National Forensic Laboratory Information System (NFLIS) data provided by the American Society of Crime Laboratory Directors. Case backlogs and turnaround times are growing. Dangerous emerging drugs are not being scheduled to make them illegal, and deaths likely associated with drug overdose are not being investigated completely by medical examiners and coroners.” The bipartisan coalition of senators, led by Senators Jeanne Shaheen (D-NH) and John Cornyn (R-TX), called upon the DOJ to provide Congress with a comprehensive list detailing DOJ efforts to support and prioritize forensic science service providers within 30 days, and to also explain how the Department is including grant programs and technical assistance for providers at the state, county, and local levels to help combat the public health crisis. The forensic science community plays a critical role in communities affected by the opioid epidemic. Labs and other forensic science service personnel help local law enforcement and federal agencies trace drugs to their source by helping to analyze evidence, find importers, manufacturers and distributors, and to determine causes of death in overdoses. As a senior member of the Senate Appropriations Committee, Senator Collins has secured significant funding for addiction treatment services. She recently announced that the Senate Appropriations Committee has   – a $665 million increase over the past two years – for the Department of Health and Human Services’ (HHS) opioid abuse treatment and prevention programs. The bill directs $500 million to State opioid crisis grants, which were authorized through the 21st Century Cures Act, a bill that was championed by Senator Collins and signed into law in December 2016. Senator King has been a leading proponent of providing additional funding to fight the heroin and opioid crisis, which kills more than one person per day in Maine. He has repeatedly called on   and both the   and   administrations to fund laws and agencies that help address the drug epidemic. Last week he   urging additional funding for the opioid epidemic, and earlier this month he joined with a group of colleagues to  legislation that would invest $45 billion for prevention, detection, surveillance and treatment of opioids. Senator King also recently wrote to President Trump urging him to allow the government to negotiate lower prices for life-saving opioid overdose reversal drugs like Naloxone.  The Senators letter to Attorney General Sessions can be read in full  . "},
{"title": "King Announces Bipartisan Agreement to Cut Red Tape for Maine Community Banks and Credit Unions, Strengthen Consumer Protections", "date": ["Tuesday, November 14, 2017"], "release": "– U.S. Senator Angus King (I-Maine) this week joined with a group of his colleagues to announce a bipartisan agreement that will improve the U.S. financial regulatory framework, promote economic growth, provide new protections to consumers, and strengthen small financial institutions in Maine. The agreement comes after months of hearings and outreach to stakeholders, companies, and consumers and includes measures from members on both sides of the aisle. Included in the agreement is language modeled after the   bipartisan legislation Senator King introduced with Senator Orrin Hatch (R-Utah) that preserves financial safety measures and broadens small bank lending opportunities to provide families, small businesses, and start-ups better credit options. Specifically, it would require the Federal Reserve to expand the number of institutions to which the Small Bank Holding Company Policy Statement applies by increasing the asset size threshold from $1 billion to $3 billion.             “Community banks and credit unions support our state’s businesses, encourage job growth, and help Maine’s hardworking men and women achieve greater financial stability and better credit options,”  . “But today, these institutions are faced with burdensome regulations that were intended to reign in Wall Street in the wake of the financial crisis. Maine people and small businesses should not be paying for these misdeeds. Better tailoring regulations for small financial institutions will help rebalance regulatory costs with their benefits without compromising the safety and soundness of the financial system.  This commonsense agreement comes after months of measured, thoughtful negotiations and would provide much needed regulatory relief to stimulate our economy and help people across our state. This is an example of how Congress can and should work.” “Access to affordable credit, including mortgages, is a credit union hallmark and fundamental to economic growth,”  . “ That’s why the credit unions of Maine thank Senator King for trying to rein in arbitrary restrictions, unnecessary regulations, and cyber threats, all of which increase costs, and reduce access to needed loans.  By providing relief in these areas, Senator King will help Maine credit unions continue serve their 700,000 members and small business owners with affordable financial services.” “The Maine Bankers Association is pleased that Senator King is joining members of the Senate Banking Committee in support of a bi-partisan bill to refine language in previously passed banking legislation,”  . “Maine banks have found that restrictive regulatory language has limited lending flexibility to Maine consumers and small businesses. Bankers have found lending to be challenging as national regulatory standards do not always work in a rural state like Maine. Passage of this legislation will expand lending opportunities for Mainers while maintaining safety and soundness standards for Maine’s already well-capitalized banking industry.” The package is targeted toward helping community banks, credit unions, mid-sized banks, regional banks and custody banks. It includes important consumer protections, particularly for veterans, senior citizens, and victims of fraud. Along with the   several provisions in the agreement are modeled on legislation Senator King has supported: This section, modeled after a provision in the  , provides that certain mortgage loans that are originated and retained in portfolio by an insured depository institution or an insured credit union with less than $10 billion in total consolidated assets will be deemed qualified mortgages under the Truth in Lending Act (TILA) while maintaining consumer protections. This section, modeled after the  , provides that an individual will be deemed to have temporary authority to act as a loan originator for 120 days under the S.A.F.E. Mortgage Licensing Act of 2008 if such person is (1) a registered loan originator who becomes employed by a state-licensed mortgage company or (2) a state-licensed loan originator who becomes employed by a state-licensed mortgage company in a different state. This section, also modeled after a provision in the   provides an exemption from escrow requirements under TILA for certain loans made by an insured depository institution or an insured credit union.   This section, also modeled after a provision in the  , (1) removes the three-day wait period required for the combined TILA/RESPA mortgage disclosure if a creditor extends to a consumer a second offer of credit with a lower annual percentage rate, and (2) expresses the sense of Congress that the CFPB should endeavor to provide clearer, authoritative guidance with respect to certain issues.  This section, also modeled after a provision in the  , provides that banking entities will be exempt from Section 13 of the Bank Holding Company Act if they have (1) less than $10 billion in total consolidated assets, and (2) total trading assets and trading liabilities that are not more than five percent of total consolidated assets. This section, modeled after  , amends the Fair Credit Reporting Act to exclude from consumer report information: (1) certain medical debt incurred by a veteran if the hospital care or medical services relating to the debt predates the credit report by less than one year; and (2) a fully paid or settled veteran's medical debt that had been characterized as delinquent, charged off, or in collection.  It also establishes a dispute process for consumer reporting agencies with respect to such veterans’ medical debt.  This section, modeled after the   extends protections to certain people who, in good faith and with reasonable care, disclose the suspected exploitation of a senior citizen to a regulatory or law-enforcement agency. This agreement is also supported by Senators Mike Crapo (R-Idaho), Joe Donnelly (D-Ind.), Heidi Heitkamp (D-N.D.), Jon Tester (D-Mont.), Mark Warner (D-Va.), Bob Corker (R-Tenn.), Tim Scott (R-S.C.), Tom Cotton (R-Ark.), Mike Rounds (R-S.D.), David Perdue (R-GA), Thom Tillis (R-N.C.), John Kennedy (R-L.A.), Jerry Moran (R-Kansas), Tim Kaine (D-Va.), Joe Manchin (D-W.V.), Claire McCaskill (D-M.O.), and Gary Peters (D-Mich.). Legislative text is in the process of being finalized and will be released upon completion. For a section-by-section summary, click  .  ###"},
{"title": "King Statement on the Passing of Thomas Hudner", "date": ["Tuesday, November 14, 2017"], "release": "U.S. Senator Angus King (I-Maine) released the following statement today on the passing of former U.S. Navy Captain Thomas Hudner, a Medal of Honor recipient and the namesake of the future  , an Arleigh Burke Class destroyer currently under construction at Bath Iron Works. “At the christening of the  I recited this quote from President John F. Kennedy: ‘As we express our gratitude, we must never forget that the highest appreciation is not to utter words of thanks but to live by them.’ Captain Thomas Hudner would never utter the word ‘hero’ in reference to himself, but that’s how he lived. A man who was willing to risk his life for that of his wingman, Captain Hudner was bravery personified. Though he will be missed, there are hundreds of men and women working tirelessly at Bath Iron Works to build the ship bearing his name, and ensure his legacy of service and sacrifice is known across the world for generations to come.” Hudner, a veteran of the Korean War, was awarded the Medal of Honor by President Harry S. Truman on April 13, 1951 for displaying uncommon valor during an attack on his fellow airman, the first African American naval aviator, Ensign Jesse L. Brown. During the Battle of Chosin Reservoir in the Korean War, anti-aircraft fire hit Brown's aircraft, causing him to crash. After it became clear that Brown was seriously injured and unable to free himself, Hudner proceeded to purposefully crash his own aircraft to join Brown and provide aid. Hudner injured his own back during his crash landing, but he stayed with Brown until a rescue helicopter arrived. Hudner and the rescue pilot worked in the sub-zero, snow-laden area in an unsuccessful attempt to free Brown, who ultimately succumbed to his injuries, from the smoking wreckage. The future   (DDG-116) was christened in April at Bath Iron Works. Senator King delivered remarks at the event and met Captain Hudner, who attended the christening. The ship is currently scheduled to be commissioned in late 2018. "},
{"title": "In Hearing on Hurricane Maria Recovery Efforts, King Calls for Development of 21st Century Energy Grid as Part of U.S. Islands Restoration Efforts", "date": ["Tuesday, November 14, 2017"], "release": "U.S. Senator Angus King (I-Maine), a member of the U.S. Senate Committee on Energy and Natural Resources (ENR), today announced his support for the  , legislation that would encourage the building of more resilient energy systems in response to the natural disasters declared during 2017. Senator King’s support for the legislation follows a hearing before the ENR Committee today on recovery efforts in Puerto Rico and the U.S. Virgin Islands in the aftermath of Hurricane Maria, which left millions of U.S. citizens without power for weeks on end.             “I think we’re all agreed here it doesn’t make sense to rebuild a 1980s grid when we have an opportunity, when we have renewables, when the economics of renewables are so much better,” . “[…]Clearly we need to amend Stafford so that it’s not simply ‘rebuild what was there before.’[…]This is an extraordinary opportunity for our country to see what a modern grid can and should look like.” The   would amend the Stafford Act, comprehensive legislation that allocates federal natural disaster assistance to state and local governments, to stipulate that funds granted to repair energy systems may be used to build more modern and resilient infrastructure. This would maximize the use of clean energy resources and energy storage technologies, and could lower the costs of energy bills for American citizens. This would also help address the key concerns raised by leaders of Puerto Rico and the U.S. Virgin Islands during today’s hearing.    Following the several significant natural disasters this fall, including Hurricanes Harvey, Irma, and Maria, Senator King supported both disaster relief packages that have come to a vote to aid affected states and territories with their rebuilding efforts. The first aid package, passed in September, approved $15.25 billion in disaster relief funding. The second disaster relief package, passed in October, approved $36.5 billion in aid to affected areas. Through his work on the ENR Committee, Senator King has continually pushed for cost-effective strategies to strengthen U.S. energy systems and support modern opportunities to make the grid more resilient. In September, Senator King announced his support for the  , bipartisan legislation that would establish an investment tax credit (ITC) for business and home use of energy storage. In 2015, the Senator also introduced  that would set national targets for energy storage in order to meet the growing demand on the electric grid and encourage the integration of solar and wind energy. Senator King also introduced the  , which would establish a set of parameters for the governance of distributed energy resources, like storage and solar. ###"},
{"title": "King Speaks Out Against Drilling in Arctic National Wildlife Refuge", "date": ["Wednesday, November 15, 2017"], "release": "– U.S. Senator Angus King (I-Maine), a member of the U.S. Committee on Energy and Natural Resources (ENR), today spoke out against drilling in the Arctic National Wildlife Refuge during an ENR Committee business meeting. The legislation considered before the committee today would authorize the Secretary of the Interior to establish and administer an oil and gas program in the Coastal Plain within the refuge.             “The words ‘wildlife refuge’ mean something it seems to me,”   “[…]We’re talking about lot of coverage of this area – in multiple wells – a minimum of 400,000 acres being leased. Alaska is 375 million acres, the state owns 105 million acres, the National Petroleum Reserve is 23 million acres, and it just strikes me that the case hasn’t been made to open up this particular, relatively small area of the state for drilling. Particularly when we’re now projecting – in the news just yesterday – a record oil production in the United States next year of almost 10 million barrels a day, rivaling that of Saudi Arabia.” The 19-million acre Arctic National Wildlife Refuge is the largest protected refuge in the United States, supports more than 250 animal species, and represents one of the last intact arctic ecosystems on the North American continent. The Coastal Plain, a 1.57-million acre section of the refuge, is the current focus for development. It is also designated as a critical habitat for polar bears under the Endangered Species Act and is an important hub for caribou, musk ox, and other wildlife. At present, the United States is world’s third largest oil producer after Russia and Saudi Arabia. There are currently 23.6 million acres in Alaska open for development at the National Petroleum Reserve. ###"},
{"title": "King Continues Push for Comprehensive Strategy to Combat Drug Crisis", "date": ["Wednesday, October 25, 2017"], "release": " – U.S Senator Angus King (I-Maine) today continued his push to establish a comprehensive strategy to combat the opioid and heroin epidemic that is devastating communities in Maine and across the country. Senator King joined a group of his colleagues to introduce the  legislation that would invest $45 billion for prevention, detection, surveillance and treatment of opioids  Senator King today also wrote to President Trump urging him to allow the government to negotiate lower prices for life-saving opioid overdose reversal drugs like Naloxone. The letter comes as the administration works to finalize its declaration of the opioid crisis as a national public health emergency, which would bolster funding and resources to hard-hit areas across America.             “The opioid and heroin epidemic is devastating communities in Maine, tearing apart families and destroying lives,”  . “It takes a comprehensive approach to fix this crippling issue so people in Maine can be safer and healthier, and it is incumbent upon Congress to provide concerned citizens, first responders, and health professionals with the resources they need to address this crisis. By providing adequate funding and expanding access to life-saving reversal drugs, we can take meaningful steps forward in our fight and help more people recover from the grip of addiction.” More specifically, the  would authorize and appropriate $4,474,800,000 for substance abuse programs for each of fiscal years 2018 through 2027. It would promote research on addiction and pain related to substance abuse, and authorizes and appropriates $50,400,000 for each of fiscal years 2018 through 2022. The bill would also expand the use of funding already allowed under 21  Century Cures Act – a bill signed into law in December 2016 to promote innovation and bolster investment in medical research – so that states may also use this money for detection, surveillance, and treatment of co-occurring infections, as well as for surveillance, data collection, and reporting on the number of opioid overdose deaths. Under the bill, the National Institutes of Health would be responsible for distributing this money. Senator King has been a leading proponent of providing additional funding to fight the heroin and opioid crisis, which kills more than one person per day in Maine. He has repeatedly called on   and both the   and   administrations to fund laws and agencies that help address the drug epidemic. Along with Senator King, the   was introduced by U.S. Senators Bob Casey (D-PA), Ed Markey (D-MA), Dianne Feinstein (D-CA), Amy Klobuchar (D-MN), Jeanne Shaheen (D-NH), Al Franken (D-MN), Martin Heinrich (D-NM), Tim Kaine (D-VA) and Maggie Hassan (D-NH). The letter can be read in full below and is available  . +++ October 25, 2017  President Donald J. Trump The White House 1600 Pennsylvania Avenue, NW Washington, DC 20500 Dear Mr. President: As you finalize the emergency declaration on opioid abuse, we urge you to follow the recommendations of your Commission on Combating Drug Addiction and the Opioid Crisis and allow the government to negotiate lower prices for life-saving opioid overdose reversal drugs. The opioid epidemic now claims 142 lives every day, and it is still getting worse. Drug overdoses are the leading cause of death for Americans under 50, exceeding the peak car crash deaths and H.I.V. deaths decades earlier. Access to naloxone, a life-saving opioid overdose reversal drug, is particularly important given the magnitude of the epidemic. Initially approved by the FDA in 1971, naloxone is used in hospitals and emergency rooms, by first responders, and by members of our communities to revive victims and restart their breathing. Unfortunately, the price of the drug itself has increased dramatically during the epidemic. The prices are highest for newer devices that make delivering the medication easier. Narcan, which administers naloxone as a nasal spray, costs $150 for a two pack and Evzio, a naloxone auto-injector, has increased from $690 in 2014 to $4,500 today for a two pack. Your Commission on Combating Drug Addiction and Opioid Crisis recommends dramatically increasing access to naloxone, and says that “By declaring a national emergency, you can empower the HHS Secretary to negotiate reduced pricing for all governmental units.” We strongly agree with the recommendation, and urge you to give the Secretary this authority immediately. By doing this, you can put the important medication in the hands of more people and save lives. We hope the policy will be the first step towards substantial action to bring down the cost of all drugs through negotiation and other policies, and part of a comprehensive emergency declaration that includes the investments needed to end the epidemic. ###"},
{"title": "King, Colleagues Call on Appropriations Subcommittee to Defund Justice Department Civil Asset Forfeiture Expansion", "date": ["Wednesday, November 8, 2017"], "release": "U.S. Senator Angus King (I-Maine) this week joined a bipartisan group of his colleagues to write to the Senate Appropriations Subcommittee on Commerce, Justice, Science and Related Agencies urging the Subcommittee to defund the Department of Justice’s (DOJ) reinstated expansion of civil asset forfeiture practices. In the letter, the Senators submit that expanding equitable sharing and adoptive seizures of property violate due process protections for American citizens outlined in the Fifth Amendment of the U.S. Constitution. “Civil asset forfeiture practices defy fundamental principles of due process that are central to our nation,”  . “Under current practices, federal law enforcement can confiscate property from individuals without first providing those affected with a hearing. Once property is confiscated, the federal government is required to show by a preponderance of the evidence—the lowest civil standard—that the property was merely   to a crime. Property owners who contend that they did not know their property was connected to a crime (for example, a property owner who lends a car to a family member or friend who commits a crime using the car) must prove their lack of knowledge—a remarkable evidentiary burden to impose on someone challenging government action. In all cases, the federal government is not required to charge someone with a crime as a prerequisite to seizing property. We believe these practices are an obvious violation of the due process protections found in the Fifth Amendment.” While in Washington, Senator King has repeatedly expressed concern over civil asset forfeiture policy. In August, Senator King wrote to Attorney General Jeff Sessions voicing concern over the DOJ’s civil asset forfeiture policy. He is a cosponsor of the Fifth Amendment Integrity Restoration (FAIR) Act, legislation that would reaffirm the tenents of the Fifth Amendment and help ensure that property owners’ rights are protected in civil forfeiture proceedings. In May, Senator King joined a bipartisan group of his colleagues to write to the Department of Justice urging the Department to review its civil asset forfeiture practices to better reflect the constitutional rights of United States citizens. Senator King was joined on the letter by U.S. Senators Rand Paul (R-Ky.), Tom Udall (D-N.M.), Mike Crapo (R-Idaho), Mike Lee (R-Utah), and Jeff Merkley (D-Ore.). The letter is below and can be read in full  . +++ November 7, 2017 Dear Chairman Shelby and Ranking Member Shaheen: In July of this year, the Department of Justice announced that it would expand the practice of civil asset forfeiture by expanding the use of equitable sharing and adoptive seizures of property. As you work with your counterparts in the House to negotiate a final Commerce, Justice, and Science (CJS) Appropriations bill for Fiscal Year (FY) 2018, we urge you to defund the implementation of these practices. During the consideration of H.R. 3354—the Make America Secure and Prosperous Appropriations Act—the House of Representatives unanimously accepted three amendments to block DOJ from reinstating a policy of adoptive forfeiture; those amendments are Walberg/Cohen #46, Raskin/Sensenbrenner #67, and Amash/Sanford #70. These amendments were championed by a diverse group of lawmakers and supported by a broad coalition of organizations, including the American Conservative Union, the Institute for Justice, the NAACP, and the ACLU. We also strongly support the inclusion of at least one of these amendments into the final CJS appropriations bill. Civil asset forfeiture practices defy fundamental principles of due process that are central to our nation. Under current practices, federal law enforcement can confiscate property from individuals without first providing those affected with a hearing. Once property is confiscated, the federal government is required to show by a preponderance of the evidence—the lowest civil standard—that the property was merely   to a crime. Property owners who contend that they did not know their property was connected to a crime (for example, a property owner who lends a car to a family member or friend who commits a crime using the car) must prove their lack of knowledge—a remarkable evidentiary burden to impose on someone challenging government action. In all cases, the federal government is not required to charge someone with a crime as a prerequisite to seizing property. We believe these practices are an obvious violation of the due process protections found in the Fifth Amendment.  Adoptive forfeiture and equitable sharing are particularly egregious elements of civil asset forfeiture because they not only violate due process but also attack principals of federalism. DOJ’s reinstated policy allows state law enforcement officers to circumvent state limitations on civil forfeiture by turning seized property over to federal officials for forfeiture in exchange for up to 80% of the proceeds of the property. This perversely incentivizes local law enforcement to confiscate suspect property even where state laws forbid the practice. As Justice  Thomas recently recognized in response to the denial of certiorari in  , “[t]h[e civil forfeiture system]—where police can seize property with limited judicial oversight and retain it for their own use—has led to egregious and well-chronicled abuses.”  We agree with Justice Thomas, and we ask you to ensure that none of our precious federal resources are used to implement these constitutionally suspect practices. Therefore, as you finalize a spending package for FY2018, we respectfully request the inclusion of language which will prevent the implementation of these polices. ###   , No. 16-122 (Mar. 6, 2017) (Thomas, J.) (respecting the denial of certiorari). "},
{"title": "King Announces Support for Bipartisan Rural Health Care Bills", "date": ["Thursday, November 9, 2017"], "release": " – Today, U.S. Senator Angus King (I-Maine) announced his support for three pieces of bipartisan legislation that would improve rural health care and support rural hospitals in Maine and across the country. Senator King’s announcement follows nearly a year of outreach to hospital administrators and health professionals throughout Maine’s rural communities to learn about the impact a repeal of the Affordable Care Act would have on rural health options and to discuss strategies to stabilize the individual health insurance marketplace and lower the costs of treatment and health coverage for people in Maine. The Act, introduced by Senator Susan Collins (R-Maine), would provide an extension for the rural add-on payment for home health services until 2022, ensuring seniors in rural communities have access to home health care for a reasonable cost. The  , introduced by Senator Chuck Grassley (R-Iowa), would create the Rural Emergency Hospital Program for hospitals located in remote and rural areas, allowing them to close some inpatient beds and services while keeping outpatient services and emergency services. The , also introduced by Senator Grassley, would make the existing Medicare-Dependent Hospital (MDH) program permanent and increase the payments provided through the Medicare Low-Volume Hospital (LVH) program. Both the MDH and LVH designation help rural hospitals maintain financial stability under the Medicare fee schedule. “People living in Maine’s rural communities should be able to access basic health care services close to home,”  “In much of our state, rural health care serves not only as a critical lifeline for local people, but also as a major economic engine that helps build healthy, vibrant communities. These bills provide an important path forward to strengthen our state’s rural hospitals and ensure people throughout Maine get the care they need.” As the Senate debates potential paths forward on health care, Senator King has been a staunch advocate for increased support of rural health services. He has met with hospital administrators and health professionals in Bridgton, Lincoln, Skowhegan, Eastport and Machias to discuss the impact changes to the Affordable Care Act would have on rural Maine clinics, hospitals, patients, and local economies. Proposed cuts to health programs like Medicaid would significantly threaten the financial stability of rural hospitals which serve as one of the top employers in fifteen out of Maine’s sixteen counties. Senator King has opposed several attempts to repeal the Affordable Care Act and has repeatedly called on his colleagues to engage in bipartisan discussions to make meaningful improvements to the law rather than rushing to repeal it. This summer, Senator King   to stabilize the health care marketplace and lower the underlying costs of treatment and health coverage for people in Maine and across the country. He is a cosponsor of the bipartisan bill introduced by Senators Lamar Alexander (R-Tenn.) and Patty Murray (D-Wash.) to stabilize the individual health insurance marketplace. ###"},
{"title": "Collins, King Introduce Legislation to Address Acadia National Park Boundary Issues ", "date": ["Thursday, November 9, 2017"], "release": "U.S. Senators Susan Collins (R-Maine) and Angus King (I-Maine) today announced they have introduced Senate legislation that would help address the concerns of communities near Acadia National Park (ANP) about boundary issues and the use of intertidal zones by harvesters of clams and worms. The bill reflects feedback from the local community on the   by Senators Collins and King and Representatives Bruce Poliquin and Chellie Pingree. A companion bill was also introduced by U.S. Representatives Bruce Poliquin and Chellie Pingree in the House of Representatives.             “Generations of Maine harvesters and wormers have earned their livings and provided for their families on the flats of the intertidal zone at Acadia,” . “The federal government must respect the longstanding rights of local people so they can support their livelihoods and strengthen Maine’s economy. This bill responds to community concerns and seeks to find commonsense solutions to ensure the National Park Service remains a good neighbor to the surrounding communities.” The legislation will also address a wide range of issues related to Acadia, including: In 2015, ANP was deeded more than 1,400 acres on the Schoodic Peninsula by an anonymous donor. This was a welcome gift from the local towns and communities. It was only after the land was transferred to ANP that the NPS informed the public that the legal authority they used for the transfer came from a 1929 law that many in the Bar Harbor area believed had been repealed in 1986, after successful efforts to pass a law that set boundary limits on the park. The boundary law was crafted due to growing concerns about the size of the park and its impact on the tax base. Further, harvesters of clams and worms in the intertidal zone near Acadia National Park raised concerns that they would not be able to continue their traditional harvesting due to enforcement measures taken by the National Park Service.  While the NPS has come to an agreement to allow these traditional harvests to continue, this law would ensure that this traditional harvest can continue uninhibited into the future. The bill originated when the local towns and residents were extremely concerned when they learned that ANP relied on the 1929 law for the Schoodic transfer because it could potentially set precedent for the NPS to use it again. Residents contacted the Maine Congressional delegation to express their concern and request for a repeal of the 1929 law, while at the same time keeping the Schoodic land transfer. In July 2016, Senator King introduced a bill in the Senate to resolve the issue. Later, the bill was amended to address other concerns regarding Acadia National Park, including lifting restrictions on a parcel in Tremont and allowing for traditional harvesting of clams and worms to continue. Earlier this year, during a confirmation hearing before the Senate Energy and Natural Resources Committee, the President’s nominee for Secretary of the Interior, Representative Ryan Zinke, also assured Senator King that, if confirmed, he would work with the Maine Congressional delegation to resolve these issues. ###"},
{"title": "King Statement on Administration’s Declaration of Opioid Crisis as a Public Health Emergency", "date": ["Thursday, October 26, 2017"], "release": ""},
{"title": "Collins, King Sign on to Bipartisan Letter In Support of U.S. Hardwood Plywood Companies Harmed by Unfair Chinese Business Practices", "date": ["Thursday, October 26, 2017"], "release": " –U.S. Senators Susan Collins (R-Maine) and Angus King (I-Maine) today announced that this week, they joined a group of bipartisan colleagues and sent a letter to the International Trade Commission (ITC) in support of a petition by the Coalition for the Fair Trade of Hardwood Plywood. In the letter, the Senators voice their support for an affirmative decision in an ongoing antidumping/countervailing duty (AD/CVD) case against Chinese hardwood plywood companies that are benefiting from unfair subsidies from the Chinese Government enabling them to sell – or “dump” – their products in the United States at less than market value. “For many small towns in America, the hardwood plywood industry is the largest source of employment,”     “When facilities are closed by unfair trade, communities are severely harmed.  Moreover, Chinese companies in the wood products sector---including hardwood plywood manufacturers—are the world’s largest consumers of illegally sourced wood material.  Chinese producers benefit from subsidies and from illegal logging, creating a playing field that tilts in their favor and against hard-working American manufacturers, costing American jobs.” The Coalition for the Fair Trade of Hardwood Plywood represents six American businesses and includes Columbia Forest Products, a hardwood plywood manufacturer which employs more than 160 people at a facility in Presque Isle. The Coalition’s petition is currently under review by both the Department of Commerce and the ITC. Both the DOC and ITC have preliminarily found in favor of the Coalition, and if each body makes a final determination in favor of the Coalition, the DOC will issue an antidumping/countervailing duty order that would instruct U.S. Customs and Border Patrol to impose final duties on each of the companies that has been found to engage in unfair practices. The Senators  letter was sent in advance of the ITC’s final hearing on the case today. In 2013, the ITC ruled against a similar petition from the American hardwood plywood industry against Chinese companies. Since that time, imports of Chinese hardwood plywood have increased by 40 percent, with imports valued at $1.12 billion in 2016. By comparison, the American hardwood plywood industry is currently operating at less than 50 percent production capacity. In addition to Senators Collins and King, the letter was signed by Senators Ron Wyden (D-Oregon), Shelley Moore Capito (R-West Virginia), Chuck Schumer (D-New York), Jeff Merkley (D-Oregon), Patrick Leahy (D-Vermont), Richard Burr (R-North Carolina), John Boozman (R-Montana), Joe Manchin (D-West Virginia), Bernard Sanders (I-Vermont), Debbie Stabenow (D-Michigan), Tammy Baldwin (D-Wisconsin), Roger Wicker (R-Mississippi) and Bill Cassidy (R-LA). The complete text of the letter is available   and below: +++ October 24, 2017  The Honorable Rhonda K. Schmidtlein The Honorable David S. Johanson Chairman, International Trade Commission              Vice-Chair, International Trade Commission     500 E Street, SW                                                        500 E Street, SW                                  Washington, DC 20436                                              Washington, DC 20436 Dear Chairman Schmidtlein and Vice-Chairman Johanson: We write to express our strong support for the efforts by American hardwood plywood manufacturers to rein in subsidized and dumped imports from China, and urge the Commission to carefully consider the facts presented by the domestic industry in the final investigation phase of this proceeding.  The International Trade Commission unanimously found in its preliminary determination in December that there was a reasonable indication that this U.S. manufacturing industry was suffering material injury due to Chinese imports.  As the Commission evaluates the evidence in this final phase, we note in particular several developments that distinguish this case from a similar one brought before the ITC in 2012.  For example, since that earlier case was filed, imports have increased another 40%.The hardwood plywood industry has suffered additional job losses despite increasing demand for wood products, more clearly demonstrating that material injury has occurred. During the prior case, U.S. hardwood plywood manufacturers were operating at no more than 50 percent of their production capacity. Since then, that number has decreased further. This is because, as the Commission found in its preliminary investigation, increasing Chinese imports undersell American-made products by substantial margins. For many small towns in America, the hardwood plywood industry is the largest source of employment. When facilities are closed by unfair trade, communities are severely harmed.  Moreover, Chinese companies in the wood products sector—including hardwood plywood manufacturers—are the world’s largest consumers of illegally sourced wood material.  Chinese producers benefit from subsidies and from illegal logging, creating a playing field that tilts in their favor and against hard-working American manufacturers, costing American jobs. We appreciate the Commission’s work to date on this important matter, and urge the Commission to ensure U.S. trade remedy laws are fully enforced."},
{"title": "Collins, King Push Back on Proposed National Park Fee Increases, Urge Interior to Consider Alternative Strategies to Fix Backlog", "date": ["Friday, October 27, 2017"], "release": "– U.S. Senators Susan Collins (R-Maine) and Angus King (I-Maine) today wrote to the U.S. Department of Interior (DOI) urging it to reconsider its proposed strategies to address the maintenance backlog in the National Park System. The letter follows an announcement this week from the DOI that it is proposing to increase fees at 17 highly-visited national parks – including Acadia National Park – during peak seasons to help offset the backlog. The proposal would nearly triple the cost of park passes for private vehicles at Acadia from $25 a pass to $70 a pass. In their letter, Senators Collins and King highlight alternative solutions to fix the issue, like leveraging excess mineral revenues to create a National Park Service Legacy Restoration Fund or establishing a Conservation Service Corps that would engage veterans’ organizations and young people with volunteer-driven conservation projects on federal lands.             “365 days a year, Acadia National Park—one of the crown jewels of the National Park System—serves as a tremendous resource for the people of Maine and the visitors who come here,”  . “From May through October, it sustains a vibrant economy in the region, bringing millions of visitors across the country and the world to the coast of Maine. Like most other parks, Acadia has felt the strain of the maintenance backlog, in part due to this sustained visitation. While we recognize that this proposal would bring additional revenue to the park, we are not certain that this would either solve the problem or outweigh the risk to the local community of making the park more difficult to visit. “According to the National Park Service, these fee increases are expected to raise $70 million annually. Given the scale of the maintenance backlog, at almost $12 billion, it is difficult to see how this represents a long-term solution to the problem, especially while the National Park Service in its 2018 budget request proposes to cut its own operations budget by $200 million and its maintenance funding by $93 million. We should keep in mind that the American people already pay for the maintenance of the National Park System through their tax dollars; if we are going to ask them directly for a greater contribution to the parks, it should be commensurate with service or more clearly justified than this proposal.” Senators Collins and King, who are members of the Appropriations Committee and Energy and Natural Resources Committee respectively, have supported a number of bipartisan initiatives that would address the maintenance backlog in the National Park System. They are both cosponsors of the , which would take excess mineral revenues to create a National Park Service Legacy Restoration Fund starting at $50 million annually and rising to $500 million by 2027. The monies from the fund would be directed to high-priority deferred maintenance needs. Additionally, in the 2016 Energy Policy Modernization Act, Senator King secured a provision that establishes the National Park Service Maintenance and Revitalization Conservation Fund which allocates $150 million annually from offshore leases towards high priority deferred maintenance needs. He is also a cosponsor of the   which would establish a service corps to help address many of the maintenance projects. The maintenance backlog, which accounts for annually deferred maintenance for the National Park System’s 75,000 plus constructed assets, had reached nearly $12 billion at the beginning of 2017. The full letter is below and can be read  . +++  October 26, 2017 The Honorable Ryan Zinke Secretary U.S. Department of Interior 1849 C Street, NW Washington, D.C. 20240 Dear Secretary Zinke: We write to express our serious concern for the National Park Service’s proposal to raise the cost of entrance passes at Acadia National Park in Maine and sixteen other highly-visited National Parks. The stated justification for the increases—the chronic maintenance backlog at our National Parks—is a worthy cause, yet this proposal both fails to adequately address that challenge while also raising the possibility of an obvious but unintended consequence: a decrease in attendance at our National Parks. We believe an immediate increase of this magnitude to the fees at Acadia, such as the increase for private vehicles from a $25 pass to a $70 pass, poses a risk to the growing visitation at Acadia. 365 days a year, Acadia National Park—one of the crown jewels of the National Park System—serves as a tremendous resource for the people of Maine and the visitors who come here. From May through October, it sustains a vibrant economy in the region, bringing millions of visitors across the country and the world to the coast of Maine. Like most other parks, Acadia has felt the strain of the maintenance backlog, in part due to this sustained visitation. While we recognize that this proposal would bring additional revenue to the park, we are not certain that this would either solve the problem or outweigh the risk to the local community of making the park more difficult to visit. According to the National Park Service, these fee increases are expected to raise $70 million annually. Given the scale of the maintenance backlog, at almost $12 billion, it is difficult to see how this represents a long-term solution to the problem, especially while the National Park Service in its 2018 budget request proposes to cut its own operations budget by $200 million and its maintenance funding by $93 million. We should keep in mind that the American people already pay for the maintenance of the National Park System through their tax dollars; if we are going to ask them directly for a greater contribution to the parks, it should be commensurate with service or more clearly justified than this proposal. We do believe, however, that in many cases money is being left on the table. To address that, we have advocated for the National Park Service to update its operations, to embrace technology and to be more creative. Only recently has the Park Service updated the cost of the lifetime Senior Pass from $10 to $80, for example. We have also pushed the Park Service to enable online and mobile pass sales to make purchasing passes more visitor friendly. We also believe the Park Service can and should target more revenue from commercial uses and visitation. In order to address the scale of the problem with the maintenance backlog, though, we need to think bigger. There have been a number of bipartisan proposals here in the Senate to address the backlog including S. 751, the National Park Service Legacy Act sponsored by Senators Warner and Portman, which would offer a dedicated revenue source to address the problem from mineral revenues. S.1460, the similarly bipartisan Energy and Natural Resources Act, contains provisions for a similar revenue source. Finally, our colleague Senator McCain has also proposed S.1403, the 21  Century Conservation Service Corps Act, which could help address many of these maintenance projects by expanding the contributions of volunteer service members. As we celebrated the Centennial of the National Park Service last year, we were reminded that these parks are monuments to our nation’s heritage. They are indeed America’s best idea. Without question, if we want to ensure that future generations are able to enjoy them as we have been able to we must properly care for them. We urge you to work with us and with Congress to adequately do so. But before taking the action of raising fees to this degree, we strongly urge you to consider all available options and to consider the full breadth of the impact of this action on Acadia and the other parks. We look forward to working with you on this matter. ###"},
{"title": "King Memorializes Life and Legacy of Richard Dudman ", "date": ["Tuesday, October 31, 2017"], "release": "– In a statement submitted to the Congressional Record last week, U.S. Senator Angus King paid tribute to the life of Richard Dudman, a career journalist and dedicated community member in the Ellsworth region. Dudman is perhaps best known for his work   which chronicles the time he spent in the captivity of Viet Cong-aligned guerillas while on assignment for the St. Louis Post-Dispatch in Cambodia during the Vietnam War. Dudman passed away this August in Blue Hill at the age of 99. “After college, Richard served his country in the Merchant Marine and the Navy before becoming a reporter for the  . In 1954 he moved to Washington, D.C. to work for the     Washington bureau. In this position he would cover the assassination of John F Kennedy, the Watergate Scandal, as well as war and revolution all over the world. “[…]Even after retiring, Richard did not stop reporting. In fact, on his last day at the   in 1981 Richard raced out of his own retirement party to cover the attempted assassination of Ronald Reagan. From his home in Ellsworth, ME Richard continued to contribute to the   and wrote editorials for the   until 2012.” The complete statement is as follows: +++ Mr. KING. Mr. President, today we remember Richard Dudman, who passed away this August in Blue Hill, ME at the age of 99. Throughout his long and illustrious career as a journalist, Richard was never one to turn away from a good story, even if chasing it meant putting himself in danger. After college, Richard served his country in the Merchant Marine and the Navy before becoming a reporter for the  . In 1954 he moved to Washington, D.C. to work for the     Washington bureau. In this position he would cover the assassination of John F Kennedy, the Watergate Scandal, as well as war and revolution all over the world.  Richard will perhaps be most remembered for the time he spent in Cambodia as a prisoner of the Viet Cong. He and his colleagues were mistaken for CIA operatives and were kept captive for forty long days. Towards the end of their captivity, once it had become clear that the journalists were not, in fact, working for the CIA, their captors began to refer to them not as prisoners of war, but as “travelers who lost their way.” It was this experience that inspired Richard to write the well-received  Even after retiring, Richard did not stop reporting. In fact, on his last day at the   in 1981 Richard raced out of his own retirement party to cover the attempted assassination of Ronald Reagan. From his home in Ellsworth, ME Richard continued to contribute to the   and wrote editorials for the   until 2012. In retirement, Richard and Helen, his wife of 69 years, were active and constructive members of the Maine community. Ellsworth City Councilor Gary Fortier, a friend of the couple, described them as “true givers;” saying that “Ellsworth is a much better place because they have been part of it.” Richard and Helen received the Golden Eagle Award from the Boy Scouts of America in 2014 in recognition of their outstanding community service. Richard’s dedication to covering the news, regardless of how far from home it occurred, won him the prestigious George Polk Award in Journalism in 1993. And in 2014, in recognition of that same dedication, Richard was inducted into the Maine Press Association Hall of Fame. I am pleased to be just one of many to remember and praise the many achievements of Richard’s career. The state of Maine was incredibly lucky to have him for the time that we did. He will be deeply missed. ###"},
{"title": "King Questions Facebook, Twitter, Google on Russian Social Media Disinformation Campaigns and Interference in 2016 Election", "date": ["Wednesday, November 1, 2017"], "release": ""},
{"title": "King, Colleagues Urge Senate Leadership to Protect Prevention and Public Health Fund", "date": ["Thursday, November 2, 2017"], "release": "– Today, U.S. Senator Angus King (I-Maine) joined 21 of his colleagues in a letter to Senate Majority Leader Mitch McConnell (R-Ky.) and Minority Leader Chuck Schumer (D-N.Y.) calling on them to protect the Prevention and Public Health Fund (PPHF) and ensure it is not used to offset the costs of reauthorizing important bipartisan health initiatives. The U.S. House of Representatives has proposed cutting 75 percent of the Prevention and Public Health Fund as part of spending legislation the House will vote on this week. “Using the PPHF as a piggy bank, even for important health programs, will result in major cuts to state, local, tribal, and territorial health departments, as well as other grantees working at the local level,”  . “Issuing cuts to the PPHF to fund community health care programs is a clear example of robbing Peter to pay Paul and will have disastrous effects for the health of children and working families. It will also only further exacerbate the long-term problem of mounting health care spending.” The Prevention and Public Health Fund, created as part of the Affordable Care Act, represents the nation’s largest investment in prevention initiatives and is used to fund critical public health programs – including childhood immunizations, smoking cessation, and lead poisoning prevention – in every state. In FY 2017, Maine received $4,797,052 worth of funding through the PPHF. Other senators signing the letter include Senators Ed Markey (D-Mass.), Patty Murray (D-Wash.), Brian Schatz (D-Hawaii), Richard Blumenthal (D-Conn.), Tom Udall (D-N.M.), Al Franken (D-Minn.), Sheldon Whitehouse (D-R.I.), Elizabeth Warren (D-Mass.), Patrick Leahy (D-Vt.), Jack Reed (D-R.I.), Sherrod Brown (D-Ohio), Cory Booker (D-N.J.), Martin Heinrich (D-N.M.), Kamala Harris (D-Calif.), Mazie Hirono (D-Hawaii), Jeanne Shaheen (D-N.H.), Maggie Hassan (D-N.H.), Chris Coons (D-Del.), Tammy Baldwin (D-Wisc.), Kirsten Gillibrand (D-N.Y.), and Bob Casey (D-Penn.). A copy of the letter is below and can be found  . +++ November 2, 2017 The Honorable Mitch McConnell                                           The Honorable Chuck Schumer Senate Majority Leader                                                          Senate Minority Leader U.S. Senate                                                                              U.S. Senate Washington, DC 20510                                                          Washington, DC 20510   Dear Leader McConnell and Leader Schumer: We write to express serious concerns regarding use of the Prevention and Public Health Fund (PPHF) to offset the costs of reauthorizing important bipartisan health initiatives. As Congress works to extend a number of vital health care programs, we encourage you to avoid further cutting the PPHF, which often works in tandem with many of these programs. The value of prevention throughout our federal health care system cannot be overstated. In fact, the best way to combat public health outbreaks and emergencies is to prevent them before they arise. As the recent hurricanes, fires, and other natural disasters have reminded us, the federal government plays a key role in identifying and preventing public health threats. Our nation spends upwards of $3 trillion annually on health care, but only an estimated three percent of this amount is dedicated to prevention and public health. Recognizing the need to increase prevention efforts in order to meet the health challenges of the 21st Century, Congress created the PPHF and made the single largest investment in prevention, which Congress allocates through the annual appropriations process. However, discretionary spending restraints established by the Budget Control Act (Public Law 112-25) necessitated the additional use of the PPHF to fill funding gaps for longstanding, core public health activities at and funded by the Centers for Disease Control and Prevention (CDC). Today, the PPHF supplies roughly 12 percent of CDC’s entire budget. While we strongly support reauthorizing and funding the various health care initiatives that have expired or will soon expire, we are concerned about efforts to cut the PPHF to offset the costs of these programs. The CHAMPIONING HEALTHY KIDS Act under consideration in the House of Representatives this week would institute a $10.5 billion reduction in the PPHF, a 75 percent cut. Using the PPHF as a piggy bank, even for important health programs, will result in major cuts to state, local, tribal, and territorial health departments, as well as other grantees working at the local level. This could mean the elimination of programs currently supported by the PPHF in every state, including: the section 317 immunization program for kids; epidemiology and laboratory capacity grants that support our state and local “disease detectives;” smoking cessation activities; lead poisoning prevention; and the Preventive Health and Human Services Block Grant. Issuing cuts to the PPHF to fund community health care programs is a clear example of robbing Peter to pay Paul and will have disastrous effects for the health of children and working families. It will also only further exacerbate the long-term problem of mounting health care spending. We urge you to avoid using the PPHF as an offset to pay for our vital health care programs and stand ready to work towards negotiating bipartisan offsets that do not come at the expense of the public’s health. Thank you for your attention to this matter.  ###"},
{"title": "Collins, King Announce Nearly $1.6 Million Loan for Fox Islands Electric Cooperative", "date": ["Friday, November 3, 2017"], "release": " – Today, U.S. Senators Susan Collins and Angus King announced that the U.S Department of Agriculture (USDA) has awarded a $1,579,000 loan to Fox Islands Electric Cooperative through USDA Rural Development’s Electric Program to support the communities on Vinalhaven and North Haven. Fox Islands Electric Cooperative will use the funds to improve five miles of electric line and make other system improvements. Fox Islands Electric Cooperative is a utility cooperative that provides electricity for the two islands. “Investing in utilities for Maine’s island communities ensures hardworking people can keep the lights on and heat their homes, and it helps small business owners innovate and grow the economy,”   “We applaud the USDA for supporting the Fox Islands Electric Co-op so it can improve and maintain the modern electric framework necessary for the people of Penobscot Bay.” The Fox Islands Electric Cooperative was founded in 1974 and is owned by the communities on Vinalhaven and North Haven. With approximately 1,950 members, the cooperative leverages power from its community-owned wind farm on Vinalhaven and also purchases electricity for the islands’ grid via a 10-mile submarine power cable from the mainland. USDA Rural Development programs provide loans and grants to assist economic expansion and job creation. Funds are directed towards infrastructure improvement, business development, homeownership, community services, public safety, and broadband access in rural areas across the country. ###"},
{"title": "In Lewiston, King Continues Open Enrollment Information Tour at Central Maine Medical Center", "date": ["Monday, November 6, 2017"], "release": " U.S. Senator Angus King (I-Maine) today continued his open enrollment information tour during a press conference at Central Maine Medical Center in Lewiston to provide information to Maine citizens about the Affordable Care Act (ACA) open enrollment period, which began on November 1 and ends on December 15 . The press conference featured health care professionals and advocates, application assisters, and health care providers and insurers.           “In the event of an unexpected illness or injury, insurance can save you from medical or financial trouble, and right now, there are a wide range of options in the health care marketplace that can help people across Maine get insured,”  . “With such a short window to secure coverage, there’s no time to put this off. December 15  will be here before you know it, and it is so important Maine people go out and shop so they and their families can be happy and healthy. To me, this isn’t something academic or political, it’s about saving lives.” In recent months, the Administration has launched numerous efforts to undermine open enrollment including reducing the length of open enrollment from 12 weeks to 6 weeks, announcing a 12-hour shutdown of the ACA website over weekends, and drastically cutting funding for advertising and insurance navigator programs. Despite these changes, the Affordable Care Act’s benefits and assistance with enrollment remain available for those who sign up within the shortened time period. Senator King has been outspoken in his desire to improve the Affordable Care Act to protect coverage for the millions who rely on it for affordable healthcare, and is a cosponsor of the bipartisan bill introduced by Senators Lamar Alexander (R-Tenn.) and Patty Murray (D-Wash.) to stabilize the individual health insurance marketplace. In October, Senator King joined health care professionals and advocates at the Opportunity Alliance in South Portland to encourage Maine people to learn more about their health care options and get coverage. For more information, Maine people can reach out to Maine Consumers for Affordable Health Care, call 1-800-965-7476, and/or visit healthcare.gov. ###"},
{"title": "Collins, King Announce $1,308,121 Grant for York County Community Action Corporation’s Head Start Programs", "date": ["Monday, November 6, 2017"], "release": "U.S. Senators Susan Collins (R-Maine) and Angus King (I-Maine) announced today the United States Department of Health and Human Services’ Administration for Children and Families has awarded the York County Community Action Corporation $1,308,121 for their Head Start and Early Head Start projects. “Head Start gives young children and families in Maine the tools they need to succeed,”  . “By expanding access to early childhood education, we are building a foundation of opportunity for Maine children and encouraging a will to learn. York County Community Action Corporation helps to strengthen Maine communities and support our state’s working families, and this federal grant money allows them to continue in their important work.” The York County Community Action Corporation helps alleviate and solve poverty for the people of York County by assisting families and seniors within the York County community. York County Community Action Corporation helps to administer economic stability programs such as Head Start, Low-Income Home Energy Assistance, and WIC. Head Start was established in 1965 to promote school readiness and provide a comprehensive array of health, nutritional, and social services to eligible four- and five-year-old preschoolers and their families. Head Start services include early learning, health, and family well-being. The Office of Head Start (OHS), an office with the Administration for Children and Families, administers grant funding and oversight to the local agencies that provide Head Start services in Maine and across the country. ###"},
{"title": "King Leads Letter to Trump Administration for Additional Funding to Combat Opioid Epidemic", "date": ["Tuesday, November 7, 2017"], "release": "– Today, Senator Angus King (I-Maine) announced that he led a letter to President Donald Trump with Senators Jeanne Shaheen (D-NH), Tammy Baldwin (D-WI) and a group of 19 senators, calling on the President to support additional funding necessary to combat the opioid epidemic. “We appreciate your formal declaration that the opioid epidemic is a National Public Health Emergency.  While this is a positive step forward, more action must be taken in order to craft a timely and effective national strategy that will achieve long term solutions to this crisis. Specifically, we are concerned that your declaration does not yet include any additional funding resources for key programs and initiatives that will help our patients, providers, first responders and researchers who desperately need more assistance,”  . , “Researchers, providers, patients, first responders, experts and policy makers agree that investing sufficient and timely resources are of paramount importance in order to allow our communities to effectively combat this epidemic.  The President’s Commission on Combatting Drug Addiction and the Opioid Crisis agrees.  The final Commission report released this week recommends that your Administration increase access to treatment and recovery programs, as well as expand the capacity for medication-assisted treatment and first responder access to overdose reversal drugs.  As such, we encourage your Administration to work closely with Congress to swiftly provide the necessary additional and sustained funding to carry out a multi-faceted approach that supports activities related to research, education, prevention, treatment and rehabilitation.” Senator King has been a leading proponent of providing additional funding to fight the heroin and opioid crisis, which kills more than one person per day in Maine. He has repeatedly called on   and both the   and   administrations to fund laws and agencies that help address the drug epidemic. Last week, he joined with a group of colleagues to  legislation that would invest $45 billion for prevention, detection, surveillance and treatment of opioids. He also recently wrote to President Trump urging him to allow the government to negotiate lower prices for life-saving opioid overdose reversal drugs like Naloxone. The letter to President Trump can be read  , and the full text is below. +++ The Honorable Donald J. Trump President The White House 1600 Pennsylvania Avenue NW Washington, D.C. 20500 Dear President Trump: We appreciate your formal declaration that the opioid epidemic is a National Public Health Emergency.  While this is a positive step forward, more action must be taken in order to craft a timely and effective national strategy that will achieve long term solutions to this crisis.  Specifically, we are concerned that your declaration does not yet include any additional funding resources for key programs and initiatives that will help our patients, providers, first responders and researchers who desperately need more assistance.  Your declaration allows the Secretary of Health and Human Services to allocate money from the Public Health Emergency Fund to support health activities and other measures to address public health emergencies.  However, only $57,000 is currently available in the Emergency Fund, which is not enough to make a meaningful difference in the face of an epidemic that claimed nearly 60,000 lives last year. In fact, according to a recent analysis done by the National Institute on Drug Abuse in May 2017, the total cost of treating prescription opioid use disorders and responding to overdoses in the United States in 2013 was $78 billion, $28.9 billion of which was for treatment. Researchers, providers, patients, first responders, experts and policy makers agree that investing sufficient and timely resources are of paramount importance in order to allow our communities to effectively combat this epidemic.  The President’s Commission on Combatting Drug Addiction and the Opioid Crisis agrees.  The final Commission report released this week recommends that your Administration increase access to treatment and recovery programs, as well as expand the capacity for medication-assisted treatment and first responder access to overdose reversal drugs.  As such, we encourage your Administration to work closely with Congress to swiftly provide the necessary additional and sustained funding to carry out a multi-faceted approach that supports activities related to research, education, prevention, treatment and rehabilitation. We stand ready to work with you on crafting an overall strategy to combat the opioid epidemic and urge you to support the additional funding needed to stem the tide of this public health emergency. "},
{"title": "Collins, King Join Bipartisan Group of Senators to Urge Federal Communications Commission to Ensure Access to Affordable Broadband in Rural Communities", "date": ["Tuesday, November 7, 2017"], "release": "U.S. Senators Susan Collins (R-Maine) and Angus King (I-Maine) joined Senators Amy Klobuchar (D-MN), Pat Roberts (R-KS), and Jerry Moran (R-KS) as part of a bipartisan group of thirty-nine senators in a letter urging the Federal Communications Commission (FCC) to ensure its commitment to affordable and reliable broadband for consumers in hardest to reach communities across rural America. “A lack of resources to meet our [shared national broadband] goals is undermining investment and consumer access to affordable broadband across much of rural America. For this reason, we write to encourage the FCC to take the much-needed step of addressing the High-Cost Universal Service Fund budget shortfall,” the senators wrote in the letter. The senators continued, “Many of the providers that serve rural consumers and businesses in our states have already begun to feel the pain of an arbitrary budget cap on High-Cost USF support. We urge the FCC to take action as quickly as possible to ensure the High-Cost USF program provides sufficient and predictable support to help deliver affordable, high-quality broadband to rural consumers.” The effort has the support of key industry associations, including NTCA-The Rural Broadband Association and the Western Telecommunications Alliance. Access to affordable, high-quality broadband is critical to our state's future and economy, and for that reason Senators Collins and King press for laws and regulations that encourage robust broadband investment in rural areas. In February, Senator King joined with Senators Klobuchar, Shelley Moore Capito (R-WV), Heidi Heitkamp (D-ND) and John Boozman (R-AR) to lead a letter in which 48 senators, including Senator Collins,  .  In May 2015, Senators Collins and King   led by Senators John Thune (R-SD) and Amy Klobuchar (D-MN) to then-FCC Chairman Wheeler urging an update to the USF to support the delivery of communications services to consumers in high-cost areas served by small, rural local exchange carriers so that they have more choice among broadband services. Increasing access to rural broadband is also an integral part of   to help grow Maine’s rural economy and create jobs. In August,   with FCC Commissioner Jessica Rosenworcel to discuss the importance of rural broadband for rural education, healthcare, and economic growth. Additionally, Senator King is a co-founder of the Senate Broadband Caucus, a bipartisan caucus working group developing solutions and strategies to accelerate broadband deployment in order to strengthen the digital economy and to close the digital divide, especially in rural America. A copy of the senators’ letter can be found  , and the full text is below. +++ Dear Commissioners: We applaud the efforts of the Federal Communications Commission (FCC) to streamline and strengthen the federal High-Cost Universal Service Fund (USF). This program is critical to achieving our shared national broadband goals and closing the digital divide.  Yet, as we and many others have noted consistently in recent years, a lack of resources to meet these national goals is undermining investment and consumer access to affordable broadband across much of rural America. For this reason, we write to encourage the FCC to take the much-needed step of addressing this USF budget shortfall. Earlier this year, approximately 160 members of Congress raised similar concerns in letters to the FCC. Since these letters were sent, many providers have continued to experience a significant reduction in support. In the ensuing months, many of us have continued to press the FCC to resolve these concerns. We believe that the FCC is best positioned to identify a solution to the budget shortfall that is limiting access to reliable and affordable broadband in rural communities.  While we recognize that a thoughtful long-term solution to the budget shortfall will take time and effort to identify and assess, many of the small providers that serve rural consumers and businesses in our states have already begun to feel the pain of an arbitrary budget cap on High-Cost USF support. We urge the FCC to take action as quickly as possible to ensure the High-Cost USF program provides sufficient and predictable support to help deliver affordable, high-quality broadband to rural consumers. At a minimum, we ask that you ensure that there is no reduction in funds allocated to or collected for the High-Cost program until you have reached a comprehensive solution to High-Cost funding. Thank you for your commitment to this important program and the millions of rural consumers who benefit from it. We look forward to both quick action and a comprehensive plan that effectively responds to this crisis."},
{"title": "King, Colleagues Urge Senate Finance Committee to Protect Retirement Savings Incentives for American Workers", "date": ["Wednesday, November 8, 2017"], "release": "U.S. Senator Angus King (I-Maine) yesterday joined a group of his colleagues to write to the Senate Finance Committee urging its leadership to protect tax incentives for American workers saving for retirement, and reject changes to the tax system that would harm existing incentives. The letter comes as the Senate majority is poised to release tax reform legislation this week. “Tax reform should be about strengthening the financial security of low-income and middle class Americans, both today and into the future,”   “Congress needs to do more to improve retirement incentives for the American people, not less.  Dramatically altering incentives for retirement simply to raise short-term revenue to pay for tax cuts for the wealthy is a cynical ploy that will harm hardworking Americans in every state.  We urge you to reject any legislation that would harm the incentives on which Americans rely today to save for their retirement.” The letter addresses concerns that a Senate tax reform proposal may include changes to the current tax incentives for Americans hoping to save for retirement, specifically by adopting so-called “Rothification,” which would eliminate or limit the amount of pre-tax money that can be contributed to 401(k) accounts.  In the letter, the Senators highlighted research showing that workers at all income levels participating in employer-sponsored retirement plans contribute on average at least $2,700 annually to their accounts.  This amount exceeds the $2,400 limit that reportedly have been considered as a new pre-tax limit for retirement account contributions. Joining Senator King on the letter are Senators Patrick Leahy (D-V.T.), Kirsten Gillibrand (D-N.Y.), Tammy Baldwin (D-Wisc.), Tammy Duckworth (D-Ill.), Maggie Hassan (D-N.H.), Jeanne Shaheen (D-N.H.), Richard Blumenthal (D-Conn.), Cory Booker (D-N.J.), Tom Udall (D-N.M.), Chris Van Hollen (D-Md.), Chris Murphy (D-Conn.), Ed Markey (D-Mass.), Jack Reed (D-R.I.), Kamala Harris (D-Calif.), and Amy Klobuchar (D-Minn.). The text of the letter is below and can be read in full  . +++ November 7, 2017 The Honorable Orrin Hatch, Chairman The Honorable Ron Wyden, Ranking Member Senate Committee on Finance 219 Dirksen Senate Office Building Washington, D.C. 20510 Dear Chairman Hatch and Ranking Member Wyden: We write to urge you to protect existing tax incentives that promote retirement savings among American workers.  A core component of the American dream is undoubtedly a comfortable and financially stable retirement.  Changes to the existing system, particularly so-called “Rothification,” which would eliminate or drastically limit pre-tax retirement savings incentives, serve to threaten the ability of the middle class to save for retirement.  Such a change is unacceptable. Employer-sponsored retirement plans are one of the primary vehicles for retirement savings in our country.  According to Pew Charitable Trusts, seventy three percent of eligible workers making between $25,000 and $49,999 participate in an employer-sponsored retirement plan when such a plan is offered, making this a critical benefit for middle-class Americans.  Further research by the Employee Benefit Research Institute found that, regardless of income level, participating workers making $10,000 per year or more contribute an average of at least $2,700 to their accounts.  Eighty percent of households with a retirement account cite the tax benefits of the account as a key incentive in their decision to save. Tax reform should be about strengthening the financial security of low-income and middle class Americans, both today and into the future.  Congress needs to do more to improve retirement incentives for the American people, not less.  Dramatically altering incentives for retirement simply to raise short-term revenue to pay for tax cuts for the wealthy is a cynical ploy that will harm hardworking Americans in every state.  We urge you to reject any legislation that would harm the incentives on which Americans rely today to save for their retirement. ###"},
{"title": "Senate Unanimously Passes King-Authored Bill to Combat Spread of Zika Virus", "date": ["Thursday, September 7, 2017"], "release": " – U.S. Senator Angus King (I-Maine) announced today that the U.S. Senate has unanimously passed the  , bipartisan legislation Senator King introduced that would help give states and localities the tools they need to fight back against mosquitos and the viruses they carry. The bill will now be sent to the House of Representatives for its consideration. “Insect-borne diseases aren’t a one-year threat – they pose a long-term challenge, which is why it’s critical we act now to prepare for future dangers,” Senator King said. “By passing this legislation, we have moved one step closer to providing our states and localities with the resources they need to defend against serious illnesses. I am grateful to my Senate colleagues for their support of the  , and am hopeful that the House can quickly pass this common-sense bill.” The Senate’s unanimous approval of the legislation comes one week after Senator King toured the Mosquito Project at Acadia National Park’s Sieur de Monts Nature Center, where he joined researchers, scientists, health professionals, and park officials to discuss prevention strategies for mosquito- and tick-borne diseases. More specifically, the   would reauthorize critical public health tools that support states and localities in their mosquito surveillance and control efforts, especially those linked to mosquitos that carry the Zika virus, and improve the nation’s preparedness for Zika and other mosquito-borne threats like West Nile virus and Eastern Equine Encephalitis (“triple-e”) virus. Zika is a mosquito-borne infectious disease that is primarily transmitted to humans by the female yellow fever (A. aegypti) and Asian tiger (A. albopictus) mosquitos. The U.S. Centers for Disease Control and Prevention has linked the Zika virus to serious health conditions, including birth defects in infants such as microcephaly as well as neurological disorders. The   takes the following three immediate steps to combat the threat of Zika and other mosquito-borne diseases: The legislation, which is also cosponsored by Senators Richard Burr (R-N.C.), Bill Nelson (D-Fla.). Marco Rubio (R-Fla.), Lamar Alexander (R-TN), Mazie Hirono (D-HI) and Patty Murray (D-WA), has been endorsed by the National Pest Management Association, the American Mosquito Control Association, the Entomological Society of America, the Infectious Diseases Society of America, and the American Academy of Pediatrics. To read the complete text of the bill, S.849, click  . ###"},
{"title": "Collins, King Announce $249,760 to Bates College Supporting the Diverse Book Finder Repository", "date": ["Thursday, September 7, 2017"], "release": " – Today, U.S. Senators Susan Collins and Angus King announced that the Institute of Museum and Library Services has awarded Bates College a total of $249,760 through its National Leadership Grants for Libraries program. This award will support Bates’ expansion of the Diverse Book Finder, a repository for children’s books, and further the development of its analysis and search engine capabilities to identify racial representation gaps in children’s library collections. “Libraries are repositories of knowledge, providing important educational resources for communities in Maine that help us all learn and grow,” . “The Diverse Book Finder will help improve our understanding of the world and prepare students to live and thrive in today’s global society. We commend Bates for their efforts to advance this educational tool.” The Diverse Book Finder furthers libraries’ efforts to foster intercultural competence and positive self-image among children and enhance their ability to succeed in our diverse world. As an online resource, this project has the potential to be accessible to librarians, educators, parents, and students worldwide. This grant will also fund training opportunities for Maine librarians through the Maine State Library. The Institute of Museum and Library Services provides federal support to libraries and museums across the country with the goal of promoting innovation, lifelong learning, and cultural and civic involvement. ###"},
{"title": "King Statement on the 16th Anniversary of the September 11th Attacks", "date": ["Monday, September 11, 2017"], "release": " –  U.S. Senator Angus King (I-Maine) released the following statement today in recognition of the 16  anniversary of the September 11, 2001 terrorist attacks: “Sixteen years ago today, terror struck at the heart of America. On this day of reflection and remembrance, we join together to remember those we lost as we pay tribute to their memories by recommitting ourselves to the very values that were attacked that day. Hope, love and compassion rose above the fear and terror we all felt that day, because in those darkest of moments, the American spirit shone through. Today, let us take a moment to remember that we are more alike than we are different, and, in honor of those we’ve lost, let us once again hold one another a little closer, love one another a little deeper, and continue to strive to uphold the American values they lived for.” ###"},
{"title": "Collins, King Announce Nearly $900,000 for Houlton Band of Maliseets to Strengthen Sexual Assault, Domestic Violence Prevention  ", "date": ["Tuesday, October 4, 2016"], "release": " — U.S. Senators Susan Collins and Angus King announced today that the Houlton Band of Maliseet Indians will receive a total of $899,732 over three years from the Office on Violence Against Women at the Department of Justice. “Victims of sexual assault and domestic violence deserve every possible resource to report and prevent these crimes,”   “We welcome this investment, which will bolster the Tribal Government’s efforts to stop violence against women and increase safety in the Maliseet community.” The project’s primary objective is to ensure that victims of domestic violence and sexual assault receive appropriate, culturally specific, and easily accessible confidential responses. The comprehensive victim services include advocacy, emergency shelter, transitional housing assistance, legal assistance, support group, a 24-hour crisis line, referrals, education, outreach, hospital accompaniment. The project will also provide for education and a coordinated community response. ###"},
{"title": "King Calls on Board of Directors for San Francisco Federal Reserve to Reject Reappointment of Wells Fargo CEO to Advisory Council", "date": ["Thursday, September 22, 2016"], "release": ""},
{"title": "King Implores Colleagues to Act on Funding to Combat Opioid and Heroin Epidemic", "date": ["Friday, September 9, 2016"], "release": ""},
{"title": "Sens. Collins, King Announce That Casco Bay Lines to Receive More Than $2.5 Million for Terminal Renovations", "date": ["Friday, August 26, 2016"], "release": ""},
{"title": "King Statement on Baton Rouge", "date": ["Sunday, July 17, 2016"], "release": "– U.S. Senator Angus King (I-Maine) released the followings statement on Baton Rouge: There are too many families across this country, of all colors and of all backgrounds, whose hearts are filled with grief and pain. While none of us knows what the answer to this problem is, I think we do know that this pain will not healed by further violence. It will only be healed through love and compassion, through listening and understanding, and through honest conversation. I deeply hope each of us can find this within ourselves during this difficult time, so we can come together to face these problems united and put an end to this needless violence.” ###"},
{"title": "At Adult Day Center, King Announces Support for Tax Credit for Family Caregivers", "date": ["Tuesday, July 19, 2016"], "release": "– During a visit to the Stewart Adult Day Center in Falmouth today, U.S. Senator Angus King (I-Maine) announced his support for the  , bipartisan legislation that would help make caring for an aging loved one easier and more affordable by providing up to a $3,000 nonrefundable tax credit to working family caregivers. Senator King announced his support for the bill during a tour of the Stewart Center, a facility that provides day care support services for Mainers living with memory impairments. There, he met with staff, community members, and their families to discuss the challenges of aging at home. The discussion also included local private sector leaders, including representatives from the Southern Maine Agency on Aging, Bath Housing, Spectrum Generations, Maine Women’s Policy Center, and Maine AARP. Prior to the roundtable, Senator King also toured the facility. According to AARP, there are an estimated 40 million family caregivers in the United States, including 178,000 in Maine – the majority of whom spend an estimated 18 hours per week providing critical support to a family member. The bipartisan   recognizes the essential role that family caregivers play in supporting aging parents or grandparents and family members with a long-term illness or disability. Importantly, these caregivers help aging people needing care stay in their homes, rather than entering a nursing or long-term care facility. More specifically, the tax credit would help alleviate some of the out of pocket financial expenses that caregivers often take on, all while balancing full or part-time employment. The credit would be available to family caregivers to provide some relief for the added costs caregivers incur, such as travel costs for transporting a loved one, home modifications to accommodate a family member’s special needs, medication management services, and more. Additionally, the credit would also phase out at higher income levels and includes important provisions to prevent double-dipping and ensure that appropriate taxpayer protections are in place. : Senator King formally cosponsored the bill last week. It was introduced by Senators Joni Ernst (R-Iowa), Michael Bennet (D-Colo.), Elizabeth Warren (D-Mass.), and Kelly Ayotte (R-N.H.). The bill is a companion to   introduced by Congressman Tom Reed (R-N.Y.) in March.    with Senator Kelly Ayotte (R-N.H.). The legislation would make independent living less burdensome for Mainers as they grow older by making federal home modification programs more accessible for older Americans. ###"},
{"title": "King, Colleagues Send Letter to DEA Calling for Stricter Limits of Opioid Pills", "date": ["Tuesday, July 19, 2016"], "release": " – U.S. Senator Angus King (I-Maine) today released a letter he sent to the U.S. Drug Enforcement Administration (DEA) calling on the agency to use its power to more aggressively combat the opioid epidemic ravaging communities from Maine and the nation. Under current law, the DEA is responsible for setting annual quotas for manufacturers’ production of schedule I and II controlled substances, including opioids, which means the DEA effectively serves as a gatekeeper for how many opioids can be produced and sold in the United States every year. In the letter, Senator King, along with several of his colleagues, urged the DEA to help keep unneeded pills from flooding the U.S. market by setting lower quotas in the coming years. For the past two decades, the DEA has approved ever-greater increases in opioid quotas, allowing production of oxycodone to increase 39-fold, hydrocodone to increase 12-fold, hydromorphone to increase 23-fold, and fentanyl to increase 25-fold. “We agree and believe efforts to halt this widespread epidemic will not be successful unless we use every tool at our disposal. We urge DEA to utilize its existing quota setting authority, to the fullest extent possible, to combat this epidemic,”  . “Fourteen billion opioid pills are now dispensed annually in the United States – enough for every adult American to have a bottle of pills. Certainly, the pharmaceutical industry is at fault for decades of misleading information about their products and the medical community bears responsibility for its role in over-prescribing these dangerous and addictive drugs, but we remain deeply troubled by the sheer volume of opioids available – volumes that are approved by DEA.” The letter sent today outlines changes the DEA should immediately adopt to improve the quota setting process, including making the quotas that each drug company receives public, justifying the public health benefits of any opioid quota increase, and taking the opioid epidemic into consideration when setting quotas. The full text of the letter, which was led by Senator Dick Durbin (D-Ill.) and cosigned by Senators Sherrod Brown (D-Ohio), Edward Markey (D-Mass.), Amy Klobuchar (D-Minn.), and Joe Manchin (D-W.Va.), can be read below: +++ July 19, 2016 The Honorable Chuck Rosenberg Acting Administrator United States Drug Enforcement Administration 8701 Morrissette Drive Springfield, VA 22152   Dear Acting Administrator Rosenberg: Our nation is in the midst of a prescription opioid and heroin crisis that is destroying the lives of our friends, our neighbors, and our family members. In 2014, 28,647 people nationwide died from an opioid overdose. As you stated in announcing the 2016 National Heroin Threat Assessment Summary, “We tend to overuse words such as ‘unprecedented’ and ‘horrific,’ but the death and destruction connected to heroin and opioids is indeed unprecedented and horrific.” We agree and believe efforts to halt this widespread epidemic will not be successful unless we use every tool at our disposal. We urge the Drug Enforcement Administration (DEA) to utilize its existing quota setting authority, to the fullest extent possible, to combat this epidemic. We have appreciated hearing about DEA’s efforts to combat the ongoing opioid crisis, including DEA’s “360 Strategy.” While this strategy lists demand reduction as a core focus, it appears primarily focused on the downstream dynamics of the problem, such as targeting the violent cartels and drug trafficking gangs responsible for perpetuating the opioid epidemic. These efforts, much like DEA take-back days, are critically important and should be commended. However, they do not go far enough. We believe DEA can and should be doing more. Each year, DEA is responsible for setting annual quotas for manufacturers’ production of schedule I and II controlled substances, including opioids. In effect, DEA serves as a gatekeeper for how many opioids are allowed to be legally sold every year in the United States. Yet, for the past two decades, DEA has approved significant increases in the aggregate volume of opioids allowed to be produced for sale in the United States. Between 1993 and 2015, DEA allowed aggregate production quotas for oxycodone to increase 39-fold, hydrocodone to increase 12-fold, hydromorphone to increase 23-fold, and fentanyl to increase 25-fold. According to IMS Health, 14 billion opioid pills are now dispensed annually in the United States – enough for every adult American to have a bottle of pills. Certainly, the pharmaceutical industry is at fault for decades of misleading information about their products and the medical community bears responsibility for its role in over-prescribing these dangerous and addictive drugs, but we remain deeply troubled by the sheer volume of opioids available – volumes that are approved by DEA. The Controlled Substances Act provides DEA with a number of authorities, which, if utilized fully, could help appropriately reduce the number of opioids available nationwide. First, when DEA, in a given year, approves a higher opioid quota than is ultimately used, DEA can and should lower the ensuing year’s quota accordingly if there is no other compelling need for the higher quota. Second, DEA has the authority to approve mid-year quota adjustments and thus could take a more judicious approach for initial opioid quota setting and allow for mid-year adjustments, if needed. Finally, when setting quotas, DEA’s authority states that “the Administrator shall consider changes in the currently accepted medical use in treatment with the class or the substances which are manufactured from it.” We believe the recent Centers for Disease Control and Prevention (CDC) Guideline for Prescribing Opioids for Chronic Pain constitutes a “change in the currently accepted medical use” of opioids and should be taken into consideration when setting future years’ opioid quotas. The 2016 CDC Guidelines recommend dramatic changes in how opioids are prescribed for chronic care patients. For instance, the medical experts at the CDC recommend that patients receive immediate-release opioids instead of extended-release or long-lasting opioids; that patients receive the lowest effective dosage of opioids possible; and that patients receive opioids for the shortest possible effective duration. Taken together, these CDC recommendations clearly demonstrate that fewer opioids will be medically necessary in the coming years. These new guidelines – coupled with recent opioid drug manufacturer settlements acknowledging both the addiction risks of these products and the insufficient research body about the effectiveness of opioids when used long term – provide grounds within the scope of DEA’s existing authority to take proactive steps to lower quotas. In addition to the steps outlined above, we also strongly urge DEA to do the following: Thank you for your commitment to finding a solution to the prescription opioid and heroin crisis. We look forward to working with you to address this epidemic and request that you outline any authorities DEA needs, but does not currently have, to address the quota-setting concerns and proposed changes outlined above. We appreciate your consideration and look forward to your response. Sincerely, ###"},
{"title": "Senators Collins, King Announce More than $1.8 Million for Lead Abatement in Portland  ", "date": ["Wednesday, July 20, 2016"], "release": "“Lead poisoning is a very serious public health threat, particularly in New England where our housing stock is older than in most other states.  Since the beginning of my Senate service, I have worked to raise awareness about this too often unseen problem,”    “As the Chairman of the Transportation, Housing and Urban Development Appropriations Subcommittee, I have successfully secured robust funding for lead abatement programs.  This $1.8 million investment to reduce lead hazards is excellent news and will help ensure that dozens of Maine families will have safe and healthy homes.” As the Chairman of the THUD Appropriations Subcommittee, Senator Collins   to increase the federal government’s commitment to lead abatement in the THUD funding bill. Senator King  in March to the THUD Appropriations Subcommittee calling for a strong investment in lead abatement efforts. The bill was approved by the full Senate by a vote of 89-8 and currently awaits consideration by the House of Representatives."},
{"title": "At Opioid Roundtable in Bangor, King Underscores Importance of Medication-Assisted Treatment in Fight Against Addiction ", "date": ["Tuesday, July 26, 2016"], "release": "– U.S. Senator Angus King (I-Maine) today convened a roundtable with nurse practitioners in Bangor that focused on the importance of working to expand medication-assisted treatment, also known as MAT, which can be a critical tool in helping people overcome opioid or heroin addiction. The discussion builds on reforms enacted by the   (CARA), which provides a community-based response to the addiction crisis facing America. The legislation specifically includes a provision supported by Senator King that increases access to MAT by allowing trained nurse practitioners and physician assistants to prescribe it. MAT is a treatment option for addiction that includes the use of medication, such as Suboxone, along with counseling and other support. Numerous studies have demonstrated MAT’s effectiveness; however it continues to remain vastly underutilized across Maine and the country at a time when treatment is desperately needed. According to the U.S. Substance Abuse and Mental Health Services Administration, an estimated 25,000 to 30,000 people in Maine wanted drug treatment but were unable to attain it. CARA, which was signed into law by the President on July 22, ushers in new reforms to fight addiction by expanding access to MAT. More specifically, the bill includes a provision that allows nurse practitioners and physician assistants who are trained and who meet other criteria to obtain a federal license to prescribe buprenorphine therapy, which is also called Suboxone. Additionally, following a request from Senator King and other lawmakers, the U.S. Department of Health and Human Services is currently working on raising a prescriber cap that limits the ability of some physicians to prescribe MAT to some patients. Under current regulations, physicians that are certified to prescribe buprenorphine for MAT are allowed to prescribe up to 30 patients initially and then after one year can request authorization to prescribe up to a maximum of 100 patients. HHS is currently working to raise that cap to 275.   Today’s discussion was the fifth roundtable that Senator King has convened across the state as part of his effort to tackle the opioid and heroin epidemic, which he has made one of his top priorities in the Senate. He has previously held discussions in  ,  ,  , and   – each of which focused on a different aspect of the opioid and heroin crisis, and each of which have helped inform his work in Washington. Senator King has introduced and supported several pieces of legislation to help tackle addiction, and continues his push for emergency funding to fight the epidemic. ###"},
{"title": "Collins, King, Pingree, Poliquin Announce That USDA Plans to Purchase an Additional 3.8 million pounds of Maine Wild Blueberries", "date": ["Thursday, July 28, 2016"], "release": " – Today, U.S. Senators Susan Collins and Angus King and Representatives Chellie Pingree and Bruce Poliquin announced the United States Department of Agriculture (USDA) plans to purchase an additional 3.8 million pounds of Maine wild blueberries to distribute to food banks and other charitable organizations across the country. Along with an earlier purchase made this year at the Delegation’s request, that would bring the total to 11.7 million pounds, amounting to an estimated $12.75 million for Maine blueberry growers. “With the harvest getting underway in the weeks ahead, this news comes at a critical time for Maine blueberry growers,”  .  “Not only will they get financial help in recovering from low prices in 2014 and 2015, but they will also be able to make room for the incoming harvest. This is welcome support for our industry in Maine, which provides for more than 3,000 jobs in its peak season.” In January, the Delegation asked the USDA to purchase surplus blueberries through its Bonus Buy program to help growers who have faced declining prices because of record crop sizes in 2014 and 2015.  USDA answered in April by announcing that it would purchase up to $13 million of product. USDA made an initial purchase in June of about 7.9 million pounds of berries at a cost of $8.6 million.  Based on that price, the additional 3.8 million pound purchase is worth an estimated $4.14 million. The Bonus Buy program supports the emergency surplus removal of commodities, which are then distributed to domestic food assistance programs. ###"}